Repository: alimalek80/fammo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, nl, tr

source: Meal
fi: Ateria
nl: Maaltijd
tr: Öğün

source: Health
fi: Terveys
nl: Gezondheid
tr: Sağlık

source: AI Suggestions History
fi: AI-ehdotusten historia
nl: AI-aanbevelingen – geschiedenis
tr: Yapay Zekâ Önerileri Geçmişi

source: Meal Recommendations
fi: Ateriasuositukset
nl: Maaltijdaanbevelingen
tr: Öğün Önerileri

source: No meal recommendations yet.
fi: Ateriasuosituksia ei ole vielä.
nl: Nog geen maaltijdaanbevelingen.
tr: Henüz öğün önerisi yok.

source: Health Reports
fi: Terveysraportit
nl: Gezondheidsrapporten
tr: Sağlık Raporları

source: No health reports yet.
fi: Terveysraportteja ei ole vielä.
nl: Nog geen gezondheidsrapporten.
tr: Henüz sağlık raporu yok.

source: No pets found.
fi: Lemmikkejä ei löytynyt.
nl: Geen huisdieren gevonden.
tr: Evcil hayvan bulunamadı.

source: Limit Reached
fi: Raja saavutettu
nl: Limiet bereikt
tr: Sınıra Ulaşıldı

source: Back to My Pets
fi: Takaisin lemmikkeihini
nl: Terug naar Mijn Huisdieren
tr: Evcil Hayvanlarıma Dön

source: You’ve reached your monthly limit of %(limit)s AI meal suggestions.
fi: Olet saavuttanut kuukausittaisen enimmäisrajan: %(limit)s AI-ateriasuositusta.
nl: Je hebt je maandlimiet van %(limit)s AI-maaltijdaanbevelingen bereikt.
tr: Aylık %(limit)s Yapay Zekâ öğün önerisi limitinize ulaştınız.

source: You’ve reached your monthly limit of %(limit)s AI health reports.
fi: Olet saavuttanut kuukausittaisen enimmäisrajan: %(limit)s AI-terveysraporttia.
nl: Je hebt je maandlimiet van %(limit)s AI-gezondheidsrapporten bereikt.
tr: Aylık %(limit)s Yapay Zekâ sağlık raporu limitinize ulaştınız.

source: No ratings
fi: Ei arvosteluja
nl: Geen beoordelingen
tr: Puanlama yok

source: Comments
fi: Kommentit
nl: Reacties
tr: Yorumlar

source: Submit
fi: Lähetä
nl: Verzenden
tr: Gönder

source: You rated:
fi: Annoit arvosanaksi:
nl: Je gaf als beoordeling:
tr: Puanınız:

source: Share this post:
fi: Jaa tämä artikkeli:
nl: Deel dit bericht:
tr: Bu gönderiyi paylaş:

source: Previous
fi: Edellinen
nl: Vorige
tr: Önceki

source: Next
fi: Seuraava
nl: Volgende
tr: Sonraki

source: Add a comment...
fi: Lisää kommentti...
nl: Plaats een reactie...
tr: Yorum ekle...

source: Post Comment
fi: Lähetä kommentti
nl: Reactie plaatsen
tr: Yorumu Gönder

source: Login to comment.
fi: Kirjaudu sisään kommentoidaksesi.
nl: Log in om te reageren.
tr: Yorum yapmak için giriş yapın.

source: Deleted user
fi: Poistettu käyttäjä
nl: Verwijderde gebruiker
tr: Silinmiş kullanıcı

source: No comments yet.
fi: Ei vielä kommentteja.
nl: Nog geen reacties.
tr: Henüz yorum yok.

source: Blog
fi: Blogi

source: FAMMO Blog
fi: FAMMO-blogi

source: All
fi: Kaikki
nl: Alles
tr: Tümü

source: No blog posts yet.
fi: Blogikirjoituksia ei ole vielä.
nl: Nog geen blogberichten.
tr: Henüz blog yazısı yok.

source: Chat with Fammo AI
fi: Keskustele Fammo AI:n kanssa
nl: Chat met FAMMO AI
tr: Fammo AI ile Sohbet

source: New Chat
fi: Uusi chat
nl: Nieuw gesprek
tr: Yeni Sohbet

source: You
fi: Sinä
nl: Jij
tr: Sen

source: Hi! Ask me anything about dog & cat care.
fi: Hei! Kysy mitä vain koirien ja kissojen hoidosta.
nl: Hoi! Stel me al je vragen over honden- en kattenverzorging.
tr: Merhaba! Köpek ve kedi bakımıyla ilgili her şeyi sorabilirsin.

source: Profile on file for %(name)s
fi: Profiili tallennettuna lemmikille %(name)s
nl: Profiel in het systeem voor %(name)s
tr: %(name)s için kayıtlı profil

source: You can ask me about diet, health risks, and daily care.
fi: Voit kysyä ruokavaliosta, terveysriskeistä ja päivittäisestä hoidosta.
nl: Je kunt me vragen stellen over voeding, gezondheidsrisico's en dagelijkse verzorging.
tr: Diyet, sağlık riskleri ve günlük bakım hakkında bana sorular sorabilirsin.

source: Error:
fi: Virhe:
nl: Fout:
tr: Hata:

source: Type your pet question…
fi: Kirjoita kysymyksesi lemmikistä…
nl: Typ hier je vraag over je huisdier…
tr: Evcil hayvan sorunu yaz…

source: The AI response is handled by the Django server.
fi: AI-vastaus käsitellään Django-palvelimella.
nl: Het AI-antwoord wordt verwerkt door de Django-server.
tr: Yapay zeka yanıtı Django sunucusu tarafından işleniyor.

source: You may contact me about my request.
fi: Voitte ottaa minuun yhteyttä pyyntöni johdosta.
nl: U mag contact met mij opnemen over mijn verzoek.
tr: Talebimle ilgili benimle iletişime geçebilirsiniz.

source: John Doe
fi: Matti Meikäläinen
nl: Jan Jansen
tr: Ahmet Yılmaz

source: you@example.com
fi: sinä@esimerkki.com
nl: jij@voorbeeld.com
tr: sizin@ornek.com

source: General Inquiry
fi: Yleinen tiedustelu
nl: Algemene vraag
tr: Genel Soru

source: Your message...
fi: Viestisi...
nl: Uw bericht...
tr: Mesajınız...

source: About Us
fi: Tietoa meistä
nl: Over ons
tr: Hakkımızda

source: About FAMMO
fi: Tietoa FAMMOsta
nl: Over FAMMO
tr: FAMMO Hakkında

source: FAMMO is an AI-powered platform that delivers personalized meal plans and smarter nutrition recommendations to help pets live healthier, happier lives.
fi: FAMMO on tekoälyä hyödyntävä alusta, joka tarjoaa yksilöllisiä ateriasuunnitelmia ja älykkäämpiä ravintosuosituksia, jotta lemmikit voivat elää terveempää ja onnellisempaa elämää.
nl: FAMMO is een AI-gestuurd platform dat gepersonaliseerde maaltijdplannen en slimme voedingsaanbevelingen levert om huisdieren gezonder en gelukkiger te laten leven.
tr: FAMMO, evcil hayvanların daha sağlıklı ve mutlu bir yaşam sürmesine yardımcı olmak için kişiselleştirilmiş öğün planları ve akıllı beslenme önerileri sunan yapay zekâ destekli bir platformdur.

source: Our Origin Story
fi: Meidän tarinamme
nl: Ons ontstaan
tr: Kuruluş Hikâyemiz

source: FAMMO was inspired by three very special pets: Misho and Mila, two beloved cats of our founders, and Manti, a happy and loyal dog owned by a close friend. Each had different food sensitivities and health needs, which made feeding them a daily challenge. That challenge turned into a mission—to create smarter, personalized pet nutrition using the power of artificial intelligence.
fi: FAMMO sai inspiraationsa kolmesta erityisestä lemmikistä: Mishosta ja Milasta, kahdesta perustajiemme rakkaasta kissasta, sekä Mantista, iloisen ja uskollisen ystävän koirasta. Jokaisella oli omat ruokaherkkyytensä ja terveystarpeensa, mikä teki ruokinnasta päivittäisen haasteen. Tästä haasteesta syntyi missio – luoda älykkäämpi, yksilöllinen lemmikkien ravitsemus tekoälyn avulla.
nl: FAMMO is geïnspireerd door drie bijzondere huisdieren: Misho en Mila, de geliefde katten van onze oprichters, en Manti, een vrolijke en trouwe hond van een goede vriend. Elk had andere voedingsgevoeligheden en zorgbehoeften, waardoor het voeren dagelijks een uitdaging was. Die uitdaging werd onze missie: slimmere, gepersonaliseerde dierenvoeding creëren met de kracht van kunstmatige intelligentie.
tr: FAMMO, üç özel evcil hayvandan ilham aldı: Kurucularımızın sevilen kedileri Misho ve Mila ile yakın bir arkadaşımıza ait mutlu ve sadık köpek Manti. Her birinin farklı besin hassasiyetleri ve sağlık ihtiyaçları vardı; bu da beslemeyi günlük bir zorluk hâline getiriyordu. Bu zorluk, yapay zekânın gücüyle daha akıllı ve kişiselleştirilmiş bir hayvan beslenmesi oluşturma misyonuna dönüştü.

source: What We Do
fi: Mitä teemme
nl: Wat we doen
tr: Ne Yapıyoruz

source: FAMMO uses AI to analyze your pet’s unique profile — from breed and weight to health conditions, allergies, and lifestyle. Based on this, we generate smart, customized meal plans that support your pet’s long-term health and happiness.
fi: FAMMO käyttää tekoälyä analysoimaan lemmikkisi yksilöllisen profiilin – rodusta ja painosta terveydentilaan, allergioihin ja elämäntapaan. Tämän perusteella luomme älykkäitä, räätälöityjä ateriasuunnitelmia, jotka tukevat lemmikkisi pitkän aikavälin terveyttä ja hyvinvointia.
nl: FAMMO gebruikt AI om het unieke profiel van je huisdier te analyseren — van ras en gewicht tot aandoeningen, allergieën en levensstijl. Op basis daarvan genereren we slimme, op maat gemaakte maaltijdplannen die de lange-termijngezondheid en het welzijn van je huisdier ondersteunen.
tr: FAMMO, evcil hayvanınızın benzersiz profilini — ırk ve kilodan sağlık durumlarına, alerjilere ve yaşam tarzına kadar — analiz etmek için yapay zekâ kullanır. Buna dayanarak, uzun vadeli sağlık ve mutluluğunu destekleyen akıllı, kişiye özel öğün planları oluştururuz.

source: Why FAMMO?
fi: Miksi FAMMO?
nl: Waarom FAMMO?
tr: Neden FAMMO?

source: AI-powered personalized nutrition plans for cats and dogs.
fi: Tekoälyyn perustuvat yksilölliset ravintosuunnitelmat koirille ja kissoille.
nl: AI-gestuurde, gepersonaliseerde voedingsplannen voor honden en katten.
tr: Kedi ve köpekler için yapay zekâ destekli kişiselleştirilmiş beslenme planları.

source: Smart ingredient matching for sensitivities and goals.
fi: Älykäs ainesosien valinta herkkyyksien ja tavoitteiden mukaan.
nl: Slimme ingrediënt-matching voor gevoeligheden en doelen.
tr: Hassasiyetler ve hedefler için akıllı içerik eşleştirme.

source: Multilingual support and intuitive design for every pet owner.
fi: Monikielinen tuki ja intuitiivinen käyttöliittymä jokaiselle lemmikinomistajalle.
nl: Meertalige ondersteuning en een intuïtief ontwerp voor elke huisdiereigenaar.
tr: Her evcil hayvan sahibi için çok dilli destek ve sezgisel tasarım.

source: Constantly evolving insights as your pet grows and changes.
fi: Jatkuvasti kehittyvä tieto lemmikkisi kasvaessa ja muuttuessa.
nl: Voortdurend evoluerende inzichten terwijl je huisdier groeit en verandert.
tr: Evcil hayvanınız büyüyüp değiştikçe sürekli gelişen içgörüler.

source: Our Mission
fi: Missiomme
nl: Onze missie
tr: Misyonumuz

source: We believe every pet deserves a diet as unique as their personality. Our mission is to transform pet nutrition through AI, making it accessible, data-driven, and built with care.
fi: Uskomme, että jokainen lemmikki ansaitsee ruokavalion, joka on yhtä yksilöllinen kuin sen luonne. Missiomme on mullistaa lemmikkien ravitsemus tekoälyn avulla – tehdä siitä saavutettavaa, dataohjattua ja huolella suunniteltua.
nl: Wij geloven dat elk huisdier een dieet verdient dat net zo uniek is als zijn karakter. Onze missie is om dierenvoeding met AI te transformeren: toegankelijk, datagedreven en met zorg opgebouwd.
tr: Her evcil hayvanın kişiliği kadar benzersiz bir diyeti hak ettiğine inanıyoruz. Misyonumuz, hayvan beslenmesini yapay zekâ ile dönüştürmek; erişilebilir, veri odaklı ve özenle hazırlanmış hâle getirmektir.

source: From Istanbul to the Netherlands
fi: Istanbulista Alankomaihin
nl: Van Istanboel naar Nederland
tr: İstanbul’dan Hollanda’ya

source: FAMMO started in Istanbul, but our journey doesn’t stop there. We're relocating to the Netherlands to expand our vision, collaborate with European pet health innovators, and bring personalized nutrition to more pets across the world.
fi: FAMMO sai alkunsa Istanbulissa, mutta matkamme ei pysähdy siihen. Olemme siirtämässä toimintaa Alankomaihin laajentaaksemme visiotamme, tehdäksemme yhteistyötä eurooppalaisten lemmikkiterveyden edelläkävijöiden kanssa ja viedäksemme yksilöllisen ravitsemuksen yhä useammalle lemmikille ympäri maailmaa.
nl: FAMMO begon in Istanboel, maar onze reis stopt daar niet. We verhuizen naar Nederland om onze visie uit te breiden, samen te werken met Europese innovators in dierengezondheid en gepersonaliseerde voeding naar meer huisdieren wereldwijd te brengen.
tr: FAMMO, İstanbul’da başladı ancak yolculuğumuz burada bitmiyor. Vizyonumuzu büyütmek, Avrupa’daki evcil hayvan sağlığı yenilikçileriyle iş birliği yapmak ve kişiselleştirilmiş beslenmeyi dünyadaki daha fazla evcil hayvana ulaştırmak için Hollanda’ya taşınıyoruz.

source: Meet the Founders
fi: Tapaa perustajat
nl: Ontmoet de oprichters
tr: Kurucularla Tanışın

source: We're a small team of developers, nutrition enthusiasts, and animal lovers — united by a shared vision to build smarter solutions for our furry companions. FAMMO isn’t just a platform, it’s a passion.
fi: Olemme pieni tiimi kehittäjiä, ravitsemusintoilijoita ja eläinrakkaita – meitä yhdistää sama visio: rakentaa älykkäämpiä ratkaisuja karvaisille ystävillemme. FAMMO ei ole pelkkä alusta, vaan intohimon projekti.
nl: We zijn een klein team van ontwikkelaars, voedingsliefhebbers en dierenvrienden — verenigd door een gedeelde visie om slimmere oplossingen te bouwen voor onze harige metgezellen. FAMMO is niet alleen een platform, het is een passie.
tr: Geliştiricilerden, beslenme meraklılarından ve hayvanseverlerden oluşan küçük bir ekibiz — tüylü dostlarımız için daha akıllı çözümler üretme vizyonunda birleşiyoruz. FAMMO sadece bir platform değil, bir tutku.

source: Contact Us
fi: Ota yhteyttä
nl: Contact
tr: Bize Ulaşın

source: Have questions, suggestions, or just want to say hi? Reach out to us at
fi: Onko sinulla kysymyksiä, ideoita tai haluatko vain sanoa hei? Ota meihin yhteyttä:
nl: Vragen, suggesties of gewoon hallo zeggen? Neem contact met ons op via
tr: Sorularınız, önerileriniz mi var ya da sadece merhaba demek mi istiyorsunuz? Bize şu adresten ulaşın:

source: Contact FAMO
fi: Ota yhteyttä FAMOon
tr: FAMO ile İletişim

source: Questions, feedback, or partnership ideas? We’d love to hear from you.
fi: Kysymyksiä, palautetta tai ideoita yhteistyöstä? Kuulemme mielellämme sinusta.
nl: Vragen, feedback of ideeën voor samenwerking? We horen graag van je.
tr: Sorular, geri bildirimler veya iş birliği fikirleri mi var? Sizden haber almak isteriz.

source: Get in touch
fi: Ota yhteyttä
nl: Neem contact op
tr: İletişime geçin

source: Fill out the form and our team will get back to you within one business day.
fi: Täytä lomake, niin tiimimme ottaa sinuun yhteyttä yhden arkipäivän kuluessa.
nl: Vul het formulier in en ons team reageert binnen één werkdag.
tr: Formu doldurun; ekibimiz bir iş günü içinde size dönüş yapacaktır.

source: Email
fi: Sähköposti
tr: E-posta

source: Address
fi: Osoite
nl: Adres
tr: Adres

source: Istanbul, Türkiye (remote-first)
fi: Istanbul, Türkiye (ensisijaisesti etätyö)
nl: Istanboel, Türkiye (remote-first)
tr: İstanbul, Türkiye (uzaktan-öncelikli)

source: Follow us
fi: Seuraa meitä
nl: Volg ons
tr: Bizi takip edin

source: Name
fi: Nimi
nl: Naam
tr: Ad Soyad

source: Subject
fi: Aihe
nl: Onderwerp
tr: Konu

source: Message
fi: Viesti
nl: Bericht
tr: Mesaj

source: Send message
fi: Lähetä viesti
nl: Bericht verzenden
tr: Mesajı gönder

source: Message Sent!
fi: Viesti lähetetty!
nl: Bericht verzonden!
tr: Mesaj Gönderildi!

source: Our team will get back to you within one business day.
fi: Tiimimme ottaa sinuun yhteyttä yhden arkipäivän kuluessa.
nl: Ons team neemt binnen één werkdag contact met je op.
tr: Ekibimiz bir iş günü içinde size dönüş yapacaktır.

source: Welcome to FAMO
fi: Tervetuloa FAMOon
nl: Welkom bij FAMO
tr: FAMO’ya Hoş Geldiniz

source: Personalized Pet Nutrition
fi: Yksilöllinen lemmikkien ravitsemus
nl: Gepersonaliseerde dierenvoeding

source: Get <span class="highlight-orange">personalized meal plans</span> and <span class="highlight-orange">preventive health reports</span> for your furry friends. Our AI analyzes your pet's unique needs to keep them healthy and happy.
fi: Saat <span class="highlight-orange">yksilölliset ateriasuunnitelmat</span> ja <span class="highlight-orange">ennaltaehkäisevät terveysraportit</span> karvaisille ystävillesi. Tekoälymme analysoi lemmikkisi yksilöllisiä tarpeita pitääkseen sen terveenä ja onnellisena.
nl: Krijg <span class="highlight-orange">gepersonaliseerde maaltijdplannen</span> en <span class="highlight-orange">preventieve gezondheidsrapporten</span> voor je harige vrienden. Onze AI analyseert de unieke behoeften van jouw huisdier om hen gezond en gelukkig te houden.
tr: Evcil hayvanınızın benzersiz ihtiyaçlarını analiz ederek onları sağlıklı ve mutlu tutan kişiselleştirilmiş öğün planları alın.

source: Powered by the FAMMO Diet Engine
fi: Taustavoimana FAMMO Diet Engine
nl: Aangedreven door de FAMMO Diet Engine
tr: FAMMO Diyet Motoru tarafından desteklenmektedir

source: Try for Free
fi: Kokeile ilmaiseksi
nl: Probeer gratis
tr: Ücretsiz Dene

source: Login / Sign Up
fi: Kirjaudu / Rekisteröidy
nl: Inloggen / Registreren
tr: Giriş Yap / Kayıt Ol

source: Get Your Pet's Nutrition & AI Health Report
fi: Hanki lemmikkisi ravinto- ja AI-terveysraportti
nl: Ontvang het Voedings- en AI-Gezondheidsrapport van je huisdier
tr: Evcil Hayvanınızın Beslenme ve Yapay Zeka Sağlık Raporunu Alın

source: Free & Easy
fi: Helppoa ja ilmaista
nl: Gratis & Eenvoudig
tr: Ücretsiz ve Kolay

source: Pet type
fi: Lemmikin tyyppi
nl: Type huisdier
tr: Evcil hayvan türü

source: Choose...
fi: Valitse...
nl: Kiezen...
tr: Seçin...

source: Cat
fi: Kissa
nl: Kat

source: Dog
fi: Koira
nl: Hond

source: Pet weight (kg)
fi: Lemmikin paino (kg)
nl: Gewicht van het huisdier (kg)
tr: Evcil hayvan ağırlığı (kg)

source: Send Info & Get Report
fi: Lähetä tiedot ja saa raportti
nl: Verzend info & ontvang rapport
tr: Bilgileri Gönder ve Raporu Al

source: Thank you! Your free personalized report is on its way.
fi: Kiitos! Ilmainen, yksilöllinen raporttisi on matkalla.
nl: Bedankt! Je gratis gepersonaliseerde rapport is onderweg.
tr: Teşekkürler! Ücretsiz kişiselleştirilmiş raporunuz yolda.

source: Why FAMO?
fi: Miksi FAMO?
nl: Waarom FAMO?

source: Personalized Meal Plans
fi: Yksilölliset ateriasuunnitelmat
nl: Gepersonaliseerde maaltijdplannen
tr: Kişiselleştirilmiş Öğün Planları

source: Tailored recommendations based on your pet's unique needs.
fi: Räätälöidyt suositukset lemmikkisi yksilöllisten tarpeiden perusteella.
nl: Aanbevelingen op maat, gebaseerd op de unieke behoeften van je huisdier.
tr: Evcil hayvanınızın benzersiz ihtiyaçlarına göre özelleştirilmiş öneriler.

source: Health Risk Alerts
fi: Terveysriskihälytykset
nl: Gezondheidsrisicowaarschuwingen
tr: Sağlık Risk Uyarıları

source: Proactive insights to keep your pet healthy and happy.
fi: Ennakoivia näkemyksiä, joiden avulla lemmikkisi pysyy terveenä ja iloisena.
nl: Proactieve inzichten om je huisdier gezond en gelukkig te houden.
tr: Evcil hayvanınızı sağlıklı ve mutlu tutmak için proaktif içgörüler.

source: Smart Pet Profiles
fi: Älykkäät lemmikkiprofiilit
nl: Slimme huisdierprofielen
tr: Akıllı Evcil Hayvan Profilleri

source: Comprehensive profiles for precise AI analysis.
fi: Laajat profiilit tarkkaa tekoälyanalyysiä varten.
nl: Uitgebreide profielen voor nauwkeurige AI-analyse.
tr: Doğru Yapay Zekâ analizi için kapsamlı profiller.

source: What Our Users Say
fi: Mitä käyttäjämme sanovat
nl: Wat onze gebruikers zeggen
tr: Kullanıcılarımız Ne Diyor

source: FAMO transformed my dog's diet! The personalized plan was easy to follow and incredibly effective.
fi: FAMO mullisti koirani ruokavalion! Yksilöllistä suunnitelmaa oli helppo noudattaa ja se oli uskomattoman tehokas.
nl: FAMO heeft het dieet van mijn hond volledig verbeterd! Het gepersonaliseerde plan was makkelijk te volgen en enorm effectief.
tr: FAMO köpeğimin diyetini değiştirdi! Kişisel plan uygulaması kolaydı ve çok etkiliydi.

source: The health risk alerts helped me act early — true preventive care!
fi: Terveysriskihälytykset auttoivat minua toimimaan ajoissa – todellista ennaltaehkäisevää hoitoa!
nl: De gezondheidsrisico-meldingen hielpen me vroeg in te grijpen — échte preventieve zorg!
tr: Sağlık risk uyarıları erken harekete geçmemi sağladı — gerçek önleyici bakım!

source: Frequently Asked Questions
fi: Usein kysytyt kysymykset
nl: Veelgestelde vragen
tr: Sıkça Sorulan Sorular

source: No FAQs have been published yet.
fi: Usein kysyttyjä kysymyksiä ei ole vielä julkaistu.
nl: Er zijn nog geen veelgestelde vragen gepubliceerd.
tr: Henüz SSS yayımlanmadı.

source: Ready to Transform Your Pet's Life?
fi: Valmis muuttamaan lemmikkisi elämän?
nl: Klaar om het leven van je huisdier te verbeteren?
tr: Evcil Hayvanınızın Hayatını Değiştirmeye Hazır mısınız?

source: Join thousands of satisfied pet owners who trust FAMO for their pets' nutrition and health.
fi: Liity tuhansien tyytyväisten lemmikinomistajien joukkoon, jotka luottavat FAMOon lemmikkiensä ravitsemuksessa ja terveydessä.
nl: Sluit je aan bij duizenden tevreden eigenaren die FAMO vertrouwen voor de voeding en gezondheid van hun huisdieren.
tr: Evcil hayvanlarının beslenmesi ve sağlığı için FAMO’ya güvenen binlerce mutlu evcil hayvan sahibine katılın.

source: Get Started Today
fi: Aloita tänään
nl: Begin vandaag nog
tr: Bugün Başlayın

source: Error
fi: Virhe
nl: Fout
tr: Hata

source: How it works
fi: Miten se toimii
nl: Hoe het werkt
tr: Nasıl çalışır

source: How FAMMO Works
fi: Miten FAMMO toimii
nl: Hoe FAMMO werkt
tr: FAMMO Nasıl Çalışır

source: At FAMMO, we make it easy to give your pet the nutrition and care they truly deserve. Here’s how our platform helps you step by step:
fi: FAMMOssa teemme lemmikkisi ravitsemuksesta ja hoidosta helppoa – juuri niin kuin se ansaitsee. Näin alustamme auttaa sinua askel askeleelta:
nl: Bij FAMMO maken we het eenvoudig om jouw huisdier de voeding en zorg te geven die het echt verdient. Zo helpt ons platform je stap voor stap:
tr: FAMMO’da, evcil hayvanınıza gerçekten hak ettiği beslenme ve bakımı vermeyi kolaylaştırıyoruz. İşte platformumuzun size adım adım nasıl yardımcı olduğu:

source: 1. Sign Up & Log In
fi: 1. Rekisteröidy ja kirjaudu sisään
nl: 1. Aanmelden & Inloggen
tr: 1. Kayıt Ol & Giriş Yap

source: Getting started is simple! Create an account with your email or Google login. In just a minute, you’ll have your own dashboard.
fi: Aloittaminen on helppoa! Luo tili sähköpostilla tai Google-kirjautumisella. Vain minuutissa sinulla on oma hallintapaneeli.
nl: Beginnen is eenvoudig! Maak een account aan met je e-mail of Google-login. Binnen een minuut heb je je eigen dashboard.
tr: Başlamak çok kolay! E-posta adresiniz veya Google hesabınızla bir hesap oluşturun. Sadece bir dakika içinde kendi kontrol panelinize sahip olacaksınız.

source: Register Now
fi: Rekisteröidy nyt
nl: Nu registreren
tr: Hemen Kayıt Ol

source: fammo login and register page
fi: fammo kirjautumis- ja rekisteröitymissivu
nl: fammo inlog- en registratiepagina
tr: FAMMO giriş ve kayıt sayfası

source: Illustration showcasing FAMMO features
fi: Kuva, joka esittelee FAMMOn ominaisuuksia
nl: Illustratie met FAMMO-functies
tr: FAMMO özelliklerini gösteren illüstrasyon

source: 2. Create Your Pet’s Profile
fi: 2. Luo lemmikkisi profiili
nl: 2. Maak het profiel van je huisdier aan
tr: 2. Evcil Hayvanınızın Profilini Oluşturun

source: Every pet is unique — that’s why we ask a few quick questions about your furry friend: Name, breed, and age, Weight & activity level, Any allergies or health conditions. Dashboard → My Pets → Add New Pet This helps our AI understand what makes your pet special.
fi: Jokainen lemmikki on ainutlaatuinen – siksi kysymme muutaman nopean kysymyksen karvaisesta ystävästäsi: Nimi, rotu ja ikä Paino ja aktiivisuustaso Mahdolliset allergiat tai sairaudet Hallintapaneeli → Lemmikkini → Lisää uusi lemmikki Tämä auttaa tekoälyämme ymmärtämään, mikä tekee lemmikistäsi erityisen.
nl: Elk huisdier is uniek — daarom stellen we een paar korte vragen over jouw vriendje: Naam, ras en leeftijd, Gewicht & activiteitsniveau, Eventuele allergieën of gezondheidsproblemen. Dashboard → Mijn Huisdieren → Nieuw Huisdier toevoegen Zo begrijpt onze AI wat jouw huisdier bijzonder maakt.
tr: Her evcil hayvan benzersizdir — bu yüzden tüylü dostunuz hakkında birkaç kısa soru soruyoruz: Adı, ırkı ve yaşı, Kilosu ve aktivite seviyesi, Herhangi bir alerji veya sağlık durumu. Kontrol Paneli → Evcil Hayvanlarım → Yeni Evcil Hayvan Ekle Bu, yapay zekâmızın evcil hayvanınızı özel kılan şeyleri anlamasına yardımcı olur.

source: 3. Get AI-Powered Recommendations
fi: 3. Saat tekoälyn tuottamat suositukset
nl: 3. Ontvang AI-gestuurde aanbevelingen
tr: 3. Yapay Zekâ Destekli Öneriler Alın
