Repository: alimalek80/fammo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, nl, tr

source: With your pet’s profile ready, you can access two powerful tools: AI Meal Suggestions → Tailored meal plans based on your pet’s needs. AI Health Reports → Preventive insights to keep your pet healthier for longer.
fi: Kun lemmikkisi profiili on valmis, saat käyttöösi kaksi tehokasta työkalua: AI-ateriasuositukset → Räätälöidyt ateriasuunnitelmat lemmikkisi tarpeiden mukaan AI-terveysraportit → Ennaltaehkäiseviä näkemyksiä, joiden avulla lemmikkisi pysyy terveempänä pidempään.
nl: Met het profiel van je huisdier klaar heb je toegang tot twee krachtige tools: AI-maaltijdsuggesties → Op maat gemaakte maaltijdplannen op basis van de behoeften van jouw huisdier. AI-gezondheidsrapporten → Preventieve inzichten om je huisdier langer gezond te houden.
tr: Evcil hayvanınızın profili hazır olduğunda iki güçlü araca erişebilirsiniz: Yapay Zekâ Yemek Önerileri → Evcil hayvanınızın ihtiyaçlarına göre özelleştirilmiş yemek planları. Yapay Zekâ Sağlık Raporları → Evcil hayvanınızı daha uzun süre sağlıklı tutmaya yönelik önleyici içgörüler.

source: (Meal suggestions currently focus on nutrition. Specific brand recommendations will be added soon as we partner with trusted pet food suppliers.)
fi: (Ateriasuosituksemme keskittyvät tällä hetkellä ravitsemukseen. Tarkemmat merkkisuositukset lisätään pian, kun teemme yhteistyötä luotettavien lemmikinruokatoimittajien kanssa.)
nl: (Maaltijdsuggesties richten zich momenteel op voeding. Specifieke merkadviezen worden binnenkort toegevoegd wanneer we samenwerken met vertrouwde leveranciers van dierenvoeding.)
tr: (Yemek önerileri şu anda beslenmeye odaklanmaktadır. Güvenilir evcil hayvan maması tedarikçileriyle iş birliği yaptıkça, belirli marka önerileri yakında eklenecektir.)

source: A stylized placeholder image representing learning and growth
fi: Tyylitelty symbolikuva, joka edustaa oppimista ja kasvua
nl: Een gestileerde voorbeeldafbeelding die leren en groei weergeeft
tr: Öğrenme ve gelişimi temsil eden stilize edilmiş örnek görsel

source: 4. Track Progress Over Time
fi: 4. Seuraa edistymistä ajan myötä
nl: 4. Volg de voortgang in de tijd
tr: 4. Zaman İçinde İlerlemeyi Takip Edin

source: Every suggestion and report is stored in your AI History, so you can follow your pet’s journey and see how their needs evolve.
fi: Jokainen suositus ja raportti tallentuu AI-historiaasi, jotta voit seurata lemmikkisi matkaa ja nähdä, miten sen tarpeet kehittyvät.
nl: Elke suggestie en elk rapport wordt opgeslagen in je AI-geschiedenis, zodat je de reis van je huisdier kunt volgen en zien hoe hun behoeften zich ontwikkelen.
tr: Her öneri ve rapor AI Geçmişinizde saklanır, böylece evcil hayvanınızın yolculuğunu takip edebilir ve ihtiyaçlarının nasıl geliştiğini görebilirsiniz.

source: 5. Your Dashboard at a Glance
fi: 5. Hallintapaneelisi yhdellä silmäyksellä
nl: 5. Jouw dashboard in één oogopslag
tr: 5. Kontrol Paneliniz Tek Bakışta

source: Your dashboard brings everything together: - Quick access to pet profiles - One-click AI tools - Edit everything - Upgrade your Plan
fi: Hallintapaneelisi kokoaa kaiken yhteen: - Nopea pääsy lemmikkiprofiileihin - Tekoälytyökalut yhdellä klikkauksella - Muokkaa kaikkia tietoja - Päivitä tilauspakettisi
nl: Je dashboard brengt alles samen: - Snel toegang tot huisdierprofielen - AI-tools met één klik - Alles bewerken - Je abonnement upgraden
tr: Kontrol paneliniz her şeyi bir araya getirir: - Evcil hayvan profillerine hızlı erişim - Tek tıkla AI araçları - Her şeyi düzenleme - Planınızı yükseltme

source: Because no two pets are alike. We believe every dog and cat deserves personalized nutrition and preventive health care — powered by AI, made simple for you.
fi: Koska mikään lemmikki ei ole täysin samanlainen. Uskomme, että jokainen koira ja kissa ansaitsee yksilöllisen ravitsemuksen ja ennaltaehkäisevän terveydenhoidon – tekoälyn tukemana ja sinulle mahdollisimman helpoksi tehtynä.
nl: Omdat geen twee huisdieren hetzelfde zijn. Wij vinden dat elke hond en kat gepersonaliseerde voeding en preventieve zorg verdient — mogelijk gemaakt door AI en voor jou eenvoudig gemaakt.
tr: Çünkü iki evcil hayvan birbirinin aynısı değildir. Her köpek ve kedinin, yapay zekâ ile desteklenen ve sizin için kolaylaştırılan kişiselleştirilmiş beslenme ve koruyucu sağlık hizmetlerini hak ettiğine inanıyoruz.

source: Start today and discover smarter feeding for a healthier, happier pet.
fi: Aloita jo tänään ja löydä fiksumpi ruokinta terveemmälle ja onnellisemmalle lemmikille.
nl: Begin vandaag en ontdek slimmer voeren voor een gezonder en gelukkiger huisdier.
tr: Bugün başlayın; daha sağlıklı ve mutlu bir evcil hayvan için daha akıllı beslenmeyi keşfedin.

source: Manage Homepage Hero Section
fi: Hallinnoi etusivun hero-osiota
nl: Startpagina-hero beheren
tr: Ana Sayfa Hero Bölümünü Yönet

source: Save Changes
fi: Tallenna muutokset
nl: Wijzigingen opslaan
tr: Değişiklikleri Kaydet

source: Manage Social Media Links
fi: Hallinnoi sosiaalisen median linkkejä
nl: Sociale-media-links beheren
tr: Sosyal Medya Bağlantılarını Yönet

source: My Pets
fi: Lemmikkini
nl: Mijn huisdieren
tr: Evcil Hayvanlarım

source: Add New Pet
fi: Lisää uusi lemmikki
nl: Nieuw huisdier toevoegen
tr: Yeni Evcil Hayvan Ekle

source: You can add unlimited pets.
fi: Voit lisätä rajattomasti lemmikkejä.
nl: Je kunt onbeperkt huisdieren toevoegen.
tr: Sınırsız sayıda evcil hayvan ekleyebilirsiniz.

source: Your plan allows up to
fi: Pakettisi sallii enintään
nl: Je abonnement staat tot
tr: Paketiniz en fazla

source: pets.
fi: lemmikkiä.
nl: huisdieren toe.
tr: evcil hayvana izin verir.

source: No type selected
fi: Tyyppiä ei valittu
nl: Geen type geselecteerd
tr: Tür seçilmedi

source: Edit
fi: Muokkaa
nl: Bewerken
tr: Düzenle

source: Are you sure you want to delete this pet?
fi: Haluatko varmasti poistaa tämän lemmikin?
nl: Weet je zeker dat je dit huisdier wilt verwijderen?
tr: Bu evcil hayvanı silmek istediğinize emin misiniz?

source: Delete
fi: Poista
nl: Verwijderen
tr: Sil

source: AI Meal
fi: AI-ateria
nl: AI-maaltijd
tr: YZ Öğünü

source: AI Health
fi: AI-terveys
nl: AI-gezondheid
tr: YZ Sağlık

source: You have not added any pets yet.
fi: Et ole vielä lisännyt yhtään lemmikkiä.
nl: Je hebt nog geen huisdieren toegevoegd.
tr: Henüz evcil hayvan eklemediniz.

source: Processing, please wait...
fi: Käsitellään, odota hetki...
nl: Bezig met verwerken, even geduld…
tr: İşleniyor, lütfen bekleyin...

source: Your AI request is being generated. This usually takes a few seconds.
fi: AI-pyyntöäsi luodaan. Tämä kestää yleensä vain muutaman sekunnin.
nl: Je AI-verzoek wordt gegenereerd. Dit duurt meestal enkele seconden.
tr: Yapay zekâ isteğiniz oluşturuluyor. Bu işlem genellikle birkaç saniye sürer.

source: Type
fi: Tyyppi
tr: Tür

source: Breed
fi: Rotu
nl: Ras
tr: Irk

source: Gender
fi: Sukupuoli
nl: Geslacht
tr: Cinsiyet

source: Neutered
fi: Steriloitu/kastroitua
nl: Gesteriliseerd/gecastreerd
tr: Kısırlaştırılmış

source: Yes,No
fi: Kyllä,Ei
nl: Ja,Nee
tr: Evet,Hayır

source: Age
fi: Ikä
nl: Leeftijd
tr: Yaş

source: Weight
fi: Paino
nl: Gewicht
tr: Kilo

source: Body Type
fi: Vartalotyyppi
nl: Lichaamstype
tr: Vücut Tipi

source: Activity Level
fi: Aktiivisuustaso
nl: Activiteitsniveau
tr: Aktivite Düzeyi

source: Food Types
fi: Ruokatyypit
nl: Voedingstypen
tr: Mama Türleri

source: Food Allergies
fi: Ruoka-allergiat
nl: Voedselallergieën
tr: Gıda Alerjileri

source: Health Issues
fi: Terveysongelmat
nl: Gezondheidsproblemen
tr: Sağlık Sorunları

source: Edit Pet
fi: Muokkaa lemmikkiä
nl: Huisdier bewerken
tr: Evcil Hayvanı Düzenle

source: Add
fi: Lisää
nl: Toevoegen
tr: Ekle

source: Pet Profile
fi: Lemmikkiprofiili
nl: Huisdierprofiel
tr: Evcil Hayvan Profili

source: Basic Info
fi: Perustiedot
nl: Basisgegevens
tr: Temel Bilgiler

source: Yes
fi: Kyllä
nl: Ja

source: No
fi: Ei
nl: Nee
tr: Hayır

source: Food & Treats
fi: Ruoka ja herkut
nl: Voer & traktaties
tr: Mama ve Ödüller

source: Update
fi: Päivitä
nl: Bijwerken
tr: Güncelle

source: Save
fi: Tallenna
nl: Opslaan
tr: Kaydet

source: Create Pet Profile
fi: Luo lemmikkiprofiili
nl: Huisdierprofiel aanmaken

source: How active is %(name)s?
fi: Kuinka aktiivinen %(name)s on?
nl: Hoe actief is %(name)s?
tr: %(name)s ne kadar aktif?

source: Is %(name)s a Girl or Boy?
fi: Onko %(name)s tyttö vai poika?
nl: Is %(name)s een meisje of een jongen?
tr: %(name)s kız mı erkek mi?

source: Is %(name)s neutered/spayed?
fi: Onko %(name)s steriloitu/kastroitu?
nl: Is %(name)s gecastreerd/gesteriliseerd?
tr: %(name)s kısırlaştırıldı mı?

source: How old is %(name)s?
fi: Kuinka vanha %(name)s on?
nl: Hoe oud is %(name)s?
tr: %(name)s kaç yaşında?

source: What breed is %(name)s?
fi: Mitä rotua %(name)s on?
nl: Welk ras is %(name)s?
tr: %(name)s hangi ırk?

source: What is %(name)s currently eating?
fi: Mitä %(name)s syö tällä hetkellä?
nl: Wat eet %(name)s op dit moment?
tr: %(name)s şu anda ne yiyor?

source: Essentials
fi: Perus

source: Wellness
fi: Hyvinvointi

source: Optimal
fi: Optimi

source: Choose Your Plan
fi: Valitse pakettisi
nl: Kies je abonnement
tr: Paketinizi Seçin

source: Update Plan
fi: Päivitä paketti
nl: Abonnement bijwerken
tr: Paketi Güncelle

source: Sign In
fi: Kirjaudu sisään
nl: Inloggen

source: Sign In to Your Account
fi: Kirjaudu sisään tilillesi
nl: Log in op je account

source: Sign in to your existing account to see your pet's personalized plan.
fi: Kirjaudu sisään nähdäksesi lemmikkisi yksilöllisen suunnitelman.
nl: Log in op je bestaande account om het gepersonaliseerde plan van je huisdier te bekijken.
tr: Evcil hayvanınızın kişisel planını görmek için mevcut hesabınıza giriş yapın.

source: Or
fi: Tai
nl: Of
tr: Veya

source: create a new account
fi: luo uusi tili
nl: maak een nieuw account aan

source: Please fix the following errors:
fi: Korjaa seuraavat virheet:
nl: Los de volgende fouten op:
tr: Lütfen aşağıdaki hataları düzeltin:

source: Email address
fi: Sähköpostiosoite
nl: E-mailadres

source: Password
fi: Salasana
nl: Wachtwoord
tr: Şifre

source: Remember me
fi: Muista minut
nl: Onthoud mij
tr: Beni hatırla

source: Forgot your password?
fi: Unohditko salasanasi?
nl: Wachtwoord vergeten?

source: Sign in
fi: Kirjaudu sisään
nl: Inloggen

source: Or continue with
fi: Tai jatka tunnuksella
nl: Of ga verder met
tr: Veya devam et

source: Continue with Google
fi: Jatka Google-tunnuksella
nl: Ga verder met Google
tr: Google ile devam et

source: Sign Up
fi: Rekisteröidy
nl: Aanmelden
tr: Kayıt Ol

source: Create Your Account
fi: Luo käyttäjätili
nl: Maak je account aan

source: You're almost there! Create your account to see your pet's personalized plan.
fi: Olet melkein valmis! Luo tili nähdäksesi lemmikkisi yksilöllisen suunnitelman.
nl: Je bent er bijna! Maak je account aan om het gepersonaliseerde plan van je huisdier te bekijken.
tr: Neredeyse bitti! Evcil hayvanınızın kişisel planını görmek için hesabınızı oluşturun.

source: sign in to your existing account
fi: kirjaudu olemassa olevalle tilillesi
nl: log in op je bestaande account
tr: mevcut hesabınıza giriş yapın

source: Password (again)
fi: Salasana (uudelleen)
nl: Wachtwoord (nogmaals)

source: Sign up
fi: Rekisteröidy
nl: Registreren

source: Make Your Plan
fi: Luo suunnitelma
nl: Maak je plan
tr: Planını Oluştur

source: AI History
fi: AI-historia
nl: AI-geschiedenis
tr: Yapay Zekâ Geçmişi

source: Trusted Partners
fi: Luotetut kumppanit
nl: Betrouwbare partners
tr: Güvenilir Partnerler

source: How it Works
fi: Miten se toimii
nl: Hoe het werkt
tr: Nasıl Çalışır

source: Dashboard
fi: Hallintapaneeli
tr: Panel

source: Clinic Dashboard
fi: Klinikan hallintapaneeli
nl: Kliniekdashboard

source: Logout
fi: Kirjaudu ulos
nl: Uitloggen
tr: Çıkış Yap

source: Login
fi: Kirjaudu sisään
nl: Inloggen
tr: Giriş Yap

source: Signup
fi: Rekisteröidy
nl: Registreren
tr: Kayıt Ol

source: Pet Management
fi: Lemmikkien hallinta
nl: Huisdierenbeheer

source: AI Services
fi: AI-palvelut
nl: AI-diensten
tr: Yapay Zeka Hizmetleri

source: Information
fi: Tietoa
nl: Informatie
tr: Bilgi

source: Account
fi: Tili
tr: Hesap

source: Sign In with Social Account
fi: Kirjaudu sosiaalisen tilin avulla
nl: Inloggen met sociaal account
tr: Sosyal Hesapla Giriş Yap

source: Connect %(provider)s
fi: Yhdistä palveluun %(provider)s
nl: %(provider)s koppelen
tr: %(provider)s hesabını bağla

source: Sign In Via %(provider)s
fi: Kirjaudu sisään palvelun %(provider)s kautta
nl: Inloggen via %(provider)s
tr: %(provider)s ile Giriş Yap

source: You are about to connect a new third-party account from %(provider)s.
fi: Olet yhdistämässä uutta kolmannen osapuolen tiliä palvelusta %(provider)s.
nl: Je staat op het punt een nieuw account van een externe partij (%(provider)s) te koppelen.
tr: %(provider)s sağlayıcısından yeni bir üçüncü taraf hesabı bağlamak üzeresiniz.

source: You are about to sign in using a third-party account from %(provider)s.
fi: Olet kirjautumassa sisään kolmannen osapuolen tilillä palvelusta %(provider)s.
nl: Je staat op het punt in te loggen met een account van een externe partij (%(provider)s).
tr: %(provider)s sağlayıcısından bir üçüncü taraf hesabıyla giriş yapmak üzeresiniz.

source: Continue
fi: Jatka
nl: Doorgaan
tr: Devam Et

source: Back to Login
fi: Takaisin kirjautumiseen
nl: Terug naar inloggen
tr: Girişe Dön

source: Confirm Password
fi: Vahvista salasana
nl: Bevestig wachtwoord
tr: Şifreyi Doğrula

source: Passwords do not match
fi: Salasanat eivät täsmää
nl: Wachtwoorden komen niet overeen
tr: Şifreler uyuşmuyor

source: Email Address
fi: Sähköpostiosoite
nl: E-mailadres
tr: E-posta Adresi

source: First Name
fi: Etunimi
nl: Voornaam
tr: Ad

source: Last Name
fi: Sukunimi
nl: Achternaam
tr: Soyad

source: Phone
fi: Puhelin
nl: Telefoon
tr: Telefon

source: City
fi: Kaupunki
nl: Stad
tr: Şehir

source: ZIP Code
fi: Postinumero
nl: Postcode
tr: Posta Kodu

source: Country
fi: Maa
nl: Land
tr: Ülke

source: Your password must contain at least 8 characters.
fi: Salasanassasi on oltava vähintään 8 merkkiä.
nl: Je wachtwoord moet minstens 8 tekens bevatten.
tr: Şifreniz en az 8 karakter içermelidir.

source: The two password fields didn't match.
fi: Kaksi salasana-kenttää eivät täsmänneet.
nl: De twee wachtwoordvelden komen niet overeen.

source: Phone Number
fi: Puhelinnumero
nl: Telefoonnummer
tr: Telefon Numarası

source: Admin Statistics
fi: Ylläpitäjän tilastot
nl: Beheerstatistieken
tr: Yönetici İstatistikleri

source: Report Actions
fi: Raporttitoiminnot
nl: Rapportacties
tr: Rapor İşlemleri

source: Download All Charts (PDF)
fi: Lataa kaikki kaaviot (PDF)
nl: Alle grafieken downloaden (PDF)
tr: Tüm Grafikleri İndir (PDF)

source: Total Users
fi: Käyttäjiä yhteensä
nl: Totaal aantal gebruikers
tr: Toplam Kullanıcı

source: Total Pets
fi: Lemmikkejä yhteensä
nl: Totaal aantal huisdieren
tr: Toplam Evcil Hayvan

source: Dogs
fi: Koiria
nl: Honden
tr: Köpekler

source: Cats
fi: Kissoja
nl: Katten
tr: Kediler

source: AI Meals
fi: AI-ateriat
nl: AI-maaltijden
tr: YZ Öğünleri

source: AI Health Reports
fi: AI-terveysraportit
nl: AI-gezondheidsrapporten
tr: YZ Sağlık Raporları

source: Users with AI Requests by Date
fi: AI-pyyntöjä tehneet käyttäjät päivittäin
nl: Gebruikers met AI-verzoeken per datum
tr: Tarihe Göre Yapay Zeka İstekleri

source: Last 7 Days
fi: Viimeiset 7 päivää
nl: Afgelopen 7 dagen

source: Last 30 Days
fi: Viimeiset 30 päivää
nl: Afgelopen 30 dagen
tr: Son 30 Gün

source: This Month
fi: Tämä kuukausi
nl: Deze maand
tr: Bu Ay

source: Last 3 Months
fi: Viimeiset 3 kuukautta
nl: Afgelopen 3 maanden
tr: Son 3 Ay

source: Last 6 Months
fi: Viimeiset 6 kuukautta
nl: Afgelopen 6 maanden
tr: Son 6 Ay

source: Last 360 Days
fi: Viimeiset 360 päivää
nl: Afgelopen 360 dagen
tr: Son 360 Gün

source: Download PDF
fi: Lataa PDF
nl: PDF downloaden

source: User Registrations by Date
fi: Käyttäjärekisteröinnit päivämäärän mukaan
nl: Gebruikersregistraties per datum
tr: Tarihe Göre Kullanıcı Kayıtları

source: User Registrations by Country
fi: Käyttäjärekisteröinnit maittain
nl: Gebruikersregistraties per land
tr: Ülkeye Göre Kullanıcı Kayıtları

source: Download Pets CSV
fi: Lataa lemmikit CSV-tiedostona
nl: Huisdieren-CSV downloaden
tr: Evcil Hayvanlar CSV’sini İndir

source: Download Users CSV
fi: Lataa käyttäjät CSV-tiedostona
nl: Gebruikers-CSV downloaden
tr: Kullanıcılar CSV’sini İndir

source: Looks like your furry friend isn’t here yet!
fi: Näyttää siltä, että karvaista ystävääsi ei ole vielä lisätty!
nl: Het lijkt erop dat je harige vriend hier nog niet is!
tr: Görünüşe göre tüylü dostunuz henüz burada değil!

source: Add your pet now to unlock personalized AI Meals and Health Reports tailored just for them!
fi: Lisää lemmikkisi nyt ja avaa käyttöön yksilölliset AI-ateriat ja terveysraportit juuri häntä varten!
nl: Voeg nu je huisdier toe om gepersonaliseerde AI-maaltijden en gezondheidsrapporten te ontgrendelen – speciaal voor hem of haar!
tr: Evcil hayvanınızı şimdi ekleyin; ona özel kişiselleştirilmiş YZ Öğünleri ve Sağlık Raporlarının kilidini açın!

source: Add Pet
fi: Lisää lemmikki
nl: Huisdier toevoegen
tr: Evcil Hayvan Ekle

source: Welcome to your dashboard!
fi: Tervetuloa hallintapaneeliisi!
nl: Welkom op je dashboard!
tr: Panelinize hoş geldiniz!

source: Profile
fi: Profiili
nl: Profiel
tr: Profil

source: Edit your personal info
fi: Muokkaa omia tietojasi
nl: Bewerk je persoonlijke gegevens
tr: Kişisel bilgilerinizi düzenleyin

source: Statistics
fi: Tilastot
nl: Statistieken
tr: İstatistikler

source: View your activity
fi: Näytä toimintasi
nl: Bekijk je activiteit
tr: Aktivitenizi görüntüleyin

source: Edit Profile
fi: Muokkaa profiilia
nl: Profiel bewerken
tr: Profili Düzenle

source: Users
fi: Käyttäjät
nl: Gebruikers
tr: Kullanıcılar

source: Homepage Hero
fi: Etusivun hero-osio
nl: Startpagina-hero
tr: Ana Sayfa Hero Bölümü

source: Social Links
fi: Sosiaalisen median linkit
nl: Sociale links
tr: Sosyal Bağlantılar

source: My Plan
fi: Pakettini
nl: Mijn abonnement
tr: Planım

source: Meal Suggestions
fi: Ateriasuositukset
nl: Maaltijdaanbevelingen
tr: Öğün Önerileri

source: Welcome Back
fi: Tervetuloa takaisin
nl: Welkom terug
tr: Tekrar Hoş Geldiniz

source: Please enter your credentials to log in.
fi: Kirjoita kirjautumistietosi.
nl: Vul je gegevens in om in te loggen.
tr: Giriş yapmak için bilgilerinizi girin.

source: Forgot password?
fi: Unohditko salasanan?
nl: Wachtwoord vergeten?
tr: Şifrenizi mi unuttunuz?

source: Don't have an account?
fi: Eikö sinulla ole tiliä?
nl: Nog geen account?
tr: Hesabınız yok mu?

source: Register here
fi: Rekisteröidy täällä
nl: Hier registreren
tr: Buradan kayıt olun

source: Password Reset Complete
fi: Salasanan vaihto valmis
nl: Wachtwoord opnieuw instellen voltooid
tr: Şifre Sıfırlama Tamamlandı

source: Your password has been set. You may go ahead and log in now.
fi: Salasanasi on asetettu. Voit nyt kirjautua sisään.
nl: Je wachtwoord is ingesteld. Je kunt nu inloggen.
tr: Şifreniz ayarlandı. Artık giriş yapabilirsiniz.

source: Set New Password
fi: Aseta uusi salasana
nl: Nieuw wachtwoord instellen
tr: Yeni Şifre Belirle

source: Change Password
fi: Vaihda salasana
nl: Wachtwoord wijzigen
tr: Şifreyi Değiştir

source: Password Reset Sent
fi: Salasanan vaihto lähetetty
nl: E-mail voor wachtwoordherstel verzonden
tr: Şifre Sıfırlama Gönderildi

source: We've emailed you instructions for setting your password. You should receive the email shortly.
fi: Olemme lähettäneet sinulle sähköpostitse ohjeet salasanan vaihtamiseksi. Hälytyksen pitäisi saapua pian.
nl: We hebben je instructies gemaild om je wachtwoord in te stellen. Je ontvangt de e-mail spoedig.
tr: Şifrenizi belirlemeniz için talimatları e-posta ile gönderdik. Kısa süre içinde elinize ulaşacaktır.

source: Forgot Password
fi: Unohtunut salasana
nl: Wachtwoord vergeten
tr: Şifre Unuttum

source: Send Reset Link
fi: Lähetä palautuslinkki
nl: Resetlink verzenden
tr: Sıfırlama Bağlantısını Gönder

source: Referred by
fi: Suosittelija
nl: Doorverwezen door
tr: Yönlendiren

source: Join FAMMO through this trusted veterinary partner
fi: Liity FAMMOon tämän luotettavan eläinklinikkakumppanin kautta
nl: Word lid van FAMMO via deze vertrouwde dierenkliniek
tr: Bu güvenilir veteriner ortağıyla FAMMO'ya katılın

source: Register
fi: Rekisteröidy
nl: Registreren
tr: Kayıt Ol

source: Create your account to connect with
fi: Luo tili, jotta voit yhdistää
nl: Maak een account aan om verbinding te maken met

source: Create your account to get started.
fi: Luo tili aloittaaksesi.
nl: Maak een account aan om te beginnen.
tr: Başlamak için hesabınızı oluşturun.

source: I agree to the
fi: Hyväksyn
nl: Ik ga akkoord met de
tr: Kabul ediyorum:

source: Terms and Conditions
fi: käyttöehdot
nl: Algemene voorwaarden
tr: Şartlar ve Koşullar

source: Sign Up with
fi: Rekisteröidy tunnuksella
nl: Aanmelden met

source: or
fi: tai
nl: of
tr: veya

source: Already have an account?
fi: Onko sinulla jo tili?
nl: Heb je al een account?
tr: Zaten hesabınız var mı?

source: Login here
fi: Kirjaudu tästä
nl: Hier inloggen
tr: Buradan giriş yapın

source: Email Confirmed!
fi: Sähköposti vahvistettu!
nl: E-mail bevestigd!
tr: E‑posta Doğrulandı!

source: Great! Now set your password to complete %(pet_name)s's profile.
fi: Hienoa! Aseta salasana viimeistelläksesi lemmikin %(pet_name)s profiilin.
nl: Top! Stel nu je wachtwoord in om het profiel van %(pet_name)s te voltooien.
tr: Harika! Şimdi %(pet_name)s profilini tamamlamak için şifrenizi belirleyin.

source: Great! Now set your password to complete your account setup.
fi: Hienoa! Aseta salasana viimeistelläksesi tilisi käyttöönoton.
nl: Top! Stel nu je wachtwoord in om je account in te richten.
tr: Harika! Şimdi hesabınızı tamamlamak için şifrenizi belirleyin.

source: Pet Profile Ready!
fi: Lemmikkiprofiili valmis!
nl: Huisdierprofiel is klaar!

source: %(pet_name)s's profile has been created and is waiting for you!
fi: Lemmikin %(pet_name)s profiili on luotu ja odottaa sinua!
nl: Het profiel van %(pet_name)s is aangemaakt en wacht op jou!
tr: %(pet_name)s profili oluşturuldu ve sizi bekliyor!

source: Your account email
fi: Tilisi sähköposti
nl: Het e-mailadres van je account
tr: Hesap e‑postanız

source: Password Requirements:
fi: Salasanan vaatimukset:
nl: Wachtwoordeisen:

source: At least 8 characters long
fi: Vähintään 8 merkkiä pitkä
nl: Minstens 8 tekens lang
tr: En az 8 karakter uzunluğunda

source: Cannot be too similar to your email
fi: Ei saa olla liian samanlainen kuin sähköpostiosoitteesi
nl: Mag niet te veel lijken op je e-mailadres
tr: E‑postanıza çok benzer olamaz

source: Cannot be a commonly used password
fi: Ei saa olla yleisesti käytetty salasana
nl: Mag geen veelgebruikt wachtwoord zijn
tr: Yaygın kullanılan bir şifre olamaz

source: Cannot be entirely numeric
fi: Ei saa koostua pelkistä numeroista
nl: Mag niet volledig numeriek zijn
tr: Tamamen sayısal olamaz

source: Complete Setup & View My Pets
fi: Viimeistele asennus ja näytä lemmikkini
nl: Setup voltooien & Mijn huisdieren bekijken
tr: Kurulumu Tamamla ve Evcil Hayvanlarımı Gör

source: Complete Setup & Continue
fi: Viimeistele asennus ja jatka
nl: Setup voltooien & Doorgaan
tr: Kurulumu Tamamla ve Devam Et

source: Your information is secure and encrypted
fi: Tietosi ovat turvassa ja salattuja
nl: Je gegevens zijn veilig en versleuteld
tr: Bilgileriniz güvende ve şifrelenmiş durumda

source: Showing
fi: Näytetään
nl: Weergave
tr: Gösteriliyor

source: Edit Your Profile
fi: Muokkaa profiiliasi
nl: Je profiel bewerken
tr: Profilinizi Düzenleyin

source: User & Pet Management
fi: Käyttäjien ja lemmikkien hallinta
nl: Beheer gebruikers & huisdieren
tr: Kullanıcı ve Evcil Hayvan Yönetimi

source: Admin
fi: Ylläpitäjä
nl: Beheerder
tr: Yönetici

source: Staff
fi: Henkilökunta
nl: Medewerker
tr: Personel
