Repository: alimalek80/fammo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, nl, tr

source: Thank you for confirming your email address
fi: Kiitos, että vahvistit sähköpostiosoitteesi
nl: Bedankt voor het bevestigen van je e-mailadres
tr: E‑posta adresinizi doğruladığınız için teşekkür ederiz

source: Welcome to FAMMO Partner Network!
fi: Tervetuloa FAMMOn kumppaniverkostoon!
nl: Welkom bij het FAMMO Partnernetwerk!

source: Your clinic
fi: Klinikkasi
nl: Je kliniek
tr: Kliniginiz

source: has successfully confirmed its email address.
fi: on onnistuneesti vahvistanut sähköpostiosoitteensa.
nl: heeft het e-mailadres succesvol bevestigd.
tr: E‑posta adresini başarıyla doğruladı.

source: Email Verified
fi: Sähköposti vahvistettu
nl: E-mail geverifieerd
tr: E‑posta Doğrulandı

source: Your email address has been successfully confirmed.
fi: Sähköpostiosoitteesi on vahvistettu onnistuneesti.
nl: Je e-mailadres is succesvol bevestigd.
tr: E‑posta adresiniz başarıyla doğrulandı.

source: Pending Review
fi: Tarkistus kesken
nl: In beoordeling
tr: İnceleme Beklemede

source: Our team is reviewing your clinic information.
fi: Tiimimme tarkistaa klinikkasi tiedot.
nl: Ons team beoordeelt op dit moment de gegevens van je kliniek.
tr: Ekibimiz klinik bilgilerinizi inceliyor.

source: What happens next?
fi: Mitä seuraavaksi tapahtuu?
nl: Wat gebeurt er nu?
tr: Sırada ne var?

source: Our admin team reviews your clinic information
fi: Ylläpitotiimimme tarkistaa klinikkasi tiedot
nl: Ons beheerteam beoordeelt de informatie van je kliniek
tr: Yönetici ekibimiz klinik bilgilerinizi gözden geçirir

source: We verify your clinic's legitimacy and details
fi: Vahvistamme klinikkasi taustat ja tiedot
nl: We verifiëren de legitimiteit en gegevens van je kliniek
tr: Kliniginizin doğruluğunu ve bilgilerini teyit ederiz

source: Your clinic gets approved and listed publicly
fi: Klinikkasi hyväksytään ja listataan julkisesti
nl: Je kliniek wordt goedgekeurd en openbaar vermeld
tr: Kliniginiz onaylanır ve herkese açık olarak listelenir

source: You get full access to your clinic dashboard
fi: Saat täyden pääsyn klinikkasi hallintapaneeliin
nl: Je krijgt volledige toegang tot je kliniekdashboard

source: Expected Timeline
fi: Arvioitu aikataulu
nl: Verwachte doorlooptijd
tr: Beklenen Zaman Çizelgesi

source: Review typically takes 1-3 business days. You'll receive an email notification once your clinic is approved.
fi: Tarkistus kestää yleensä 1–3 arkipäivää. Saat sähköposti-ilmoituksen, kun klinikkasi on hyväksytty.
nl: De beoordeling duurt meestal 1–3 werkdagen. Je ontvangt een e-mail zodra je kliniek is goedgekeurd.
tr: İnceleme genellikle 1‑3 iş günü sürer. Klinik onaylandığında size e‑posta ile bildirim yapılır.

source: View Partner Clinics
fi: Näytä kumppaniklinikat
nl: Partnerklinieken bekijken
tr: Partner Kliniklerini Gör

source: Questions about your registration?
fi: Kysyttävää rekisteröitymisestäsi?
nl: Vragen over je registratie?
tr: Kayıt işleminizle ilgili sorularınız mı var?

source: Contact our support team
fi: Ota yhteyttä tukeemme
nl: Neem contact op met ons ondersteuningsteam
tr: Destek ekibimizle iletişime geçin

source: Verified
fi: Vahvistettu
nl: Geverifieerd
tr: Doğrulandı

source: View Profile
fi: Näytä profiili
nl: Profiel bekijken

source: Get Referred
fi: Hanki suositus
nl: Laat je doorverwijzen
tr: Yönlendirme Al

source: Partner Clinics
fi: Yhteistyöklinikat
nl: Partnerklinieken
tr: Partner Klinikler

source: Trusted Partner Clinics
fi: Luotetut yhteistyöklinikat
nl: Vertrouwde partnerklinieken
tr: Güvenilir Partner Klinikler

source: Find verified veterinary clinics that are part of the FAMMO network. These trusted partners are committed to providing exceptional pet care.
fi: Löydä vahvistetut eläinklinikat, jotka kuuluvat FAMMOn verkostoon. Nämä luotetut kumppanit ovat sitoutuneet tarjoamaan poikkeuksellista lemmikkien hoitoa.
nl: Vind geverifieerde dierenklinieken die deel uitmaken van het FAMMO-netwerk. Deze vertrouwde partners zetten zich in voor uitstekende zorg voor huisdieren.
tr: FAMMO ağına dahil doğrulanmış veteriner kliniklerini bulun. Bu güvenilir partnerler üstün evcil hayvan bakımı sunmaya kendini adamıştır.

source: Search clinics by name, city, or specialization...
fi: Hae klinikoita nimen, kaupungin tai erikoisalan perusteella...
nl: Zoek klinieken op naam, stad of specialisatie...
tr: Kliniği ada, şehir veya uzmanlığa göre ara...

source: Search
fi: Hae
nl: Zoeken
tr: Ara

source: Find near me
fi: Etsi läheltäni
nl: Zoek bij mij in de buurt
tr: Yakınımı Bul

source: Search radius
fi: Hakusäde
nl: Zoekradius
tr: Arama yarıçapı

source: Clinics near you
fi: Klinikat lähellä sinua
nl: Klinieken bij jou in de buurt
tr: Size yakın klinikler

source: Clear
fi: Tyhjennä
nl: Wissen
tr: Temizle

source: %(counter)s clinic found
fi: %(counter)s klinikka löytyi
nl: %(counter)s kliniek gevonden

source: Register Your Clinic
fi: Rekisteröi klinikkasi
nl: Registreer je kliniek

source: No clinics found
fi: Klinikoita ei löytynyt
nl: Geen klinieken gevonden

source: Try adjusting your search criteria.
fi: Kokeile muuttaa hakuehtoja.
nl: Probeer je zoekcriteria aan te passen.
tr: Lütfen arama kriterlerinizi değiştirin.

source: First
fi: Ensimmäinen
nl: Eerste

source: Last
fi: Viimeinen
nl: Laatste

source: No nearby clinics found in the selected radius.
fi: Valitun säteen sisältä ei löytynyt klinikoita.
nl: Geen klinieken in de buurt gevonden binnen de gekozen radius.
tr: Seçilen yarıçap içinde klinik bulunamadı.

source: Locating…
fi: Paikannetaan…
nl: Locatie wordt bepaald…
tr: Konum belirleniyor…

source: Searching for clinics near your location…
fi: Etsitään klinikoita sijaintisi läheltä…
nl: Bezig met zoeken naar klinieken bij jouw locatie…
tr: Konumunuza yakın klinikler aranıyor…

source: Unable to fetch nearby clinics. Please try again.
fi: Lähiklinikoiden hakeminen epäonnistui. Yritä uudelleen.
nl: Kan geen klinieken in de buurt ophalen. Probeer het opnieuw.
tr: Yakındaki klinikler getirilemedi. Lütfen tekrar deneyin.

source: Geolocation is not supported by your browser.
fi: Sijainnin määritys ei ole tuettu selaimessasi.
nl: Geolocatie wordt niet ondersteund door je browser.
tr: Tarayıcınız konum belirlemeyi desteklemiyor.

source: Location permission denied or unavailable. You can type your city or try again.
fi: Sijaintilupa evätty tai ei käytettävissä. Voit kirjoittaa kaupunkisi tai yrittää uudelleen.
nl: Locatietoegang geweigerd of niet beschikbaar. Je kunt je stad intypen of het opnieuw proberen.
tr: Konum izni reddedildi veya kullanılamıyor. Şehrinizi yazabilir veya tekrar deneyebilirsiniz.

source: Welcome from
fi: Tervetuloa – suositellut sinulle
nl: Welkom namens

source: Verified FAMMO Partner
fi: Vahvistettu FAMMO-kumppani
nl: Geverifieerde FAMMO-partner
tr: Doğrulanmış FAMMO Partneri

source: You've been invited to join FAMMO by a trusted veterinary clinic. Get personalized pet care recommendations and expert advice.
fi: Luotettu eläinklinikka on kutsunut sinut liittymään FAMMOon. Saat yksilöllisiä suosituksia lemmikkisi hoitoon ja asiantuntijaneuvoja.
nl: Je bent uitgenodigd om lid te worden van FAMMO door een vertrouwde dierenkliniek. Krijg gepersonaliseerde aanbevelingen voor de zorg van je huisdier en deskundig advies.
tr: Güvenilir bir veteriner kliniği tarafından FAMMO’ya davet edildiniz. Kişiselleştirilmiş bakım önerileri ve uzman tavsiyeleri alın.

source: Why Join FAMMO?
fi: Miksi liittyä FAMMOon?
nl: Waarom lid worden van FAMMO?

source: Personalized Pet Care
fi: Yksilöllinen lemmikin hoito
nl: Gepersonaliseerde zorg voor huisdieren

source: Get AI-powered recommendations tailored to your pet's specific needs, age, and health conditions.
fi: Saat tekoälyn tuottamia suosituksia, jotka on räätälöity lemmikkisi tarpeiden, iän ja terveydentilan mukaan.
nl: Krijg AI-gestuurde aanbevelingen die zijn afgestemd op de specifieke behoeften, leeftijd en gezondheidstoestand van je huisdier.
tr: Evcil hayvanınızın ihtiyaçlarına, yaşına ve sağlık durumuna göre yapay zeka destekli öneriler alın.

source: Trusted Network
fi: Luotettu verkosto
nl: Vertrouwd netwerk
tr: Güvenilir Ağ

source: Connect with verified veterinarians and get expert advice from professionals you can trust.
fi: Yhdisty vahvistettuihin eläinlääkäreihin ja saa asiantuntijaneuvoja ammattilaisilta, joihin voit luottaa.
nl: Kom in contact met geverifieerde dierenartsen en krijg deskundig advies van professionals die je kunt vertrouwen.
tr: Doğrulanmış veterinerlerle bağlantı kurun ve güvenilir uzman tavsiyeleri alın.

source: Educational Resources
fi: Opasmateriaali
nl: Educatieve bronnen
tr: Eğitim Kaynakları

source: Access a wealth of pet care information, guides, and tips from veterinary experts.
fi: Pääset käsiksi runsaaseen lemmikin hoitoa käsittelevään tietoon, oppaisiin ja vinkkeihin eläinlääkäriasiantuntijoilta.
nl: Krijg toegang tot een schat aan informatie, gidsen en tips over huisdierverzorging van dierenarts-experts.
tr: Veteriner uzmanlardan bilgi, rehber ve bakım ipuçlarına erişin.

source: 24/7 Support
fi: 24/7-tuki
nl: 24/7 ondersteuning
tr: 7/24 Destek

source: Get help whenever you need it with our AI-powered support and community.
fi: Saat apua milloin tahansa tekoälypohjaisen tukemme ja yhteisömme avulla.
nl: Krijg hulp wanneer je die nodig hebt via onze AI-ondersteuning en community.
tr: Her zaman yardım alın — yapay zeka destekli destek ve topluluk ile.

source: About Your Referring Clinic
fi: Tietoa suosittelevasta klinikasta
nl: Over de doorverwijzende kliniek
tr: Yönlendiren Kliniğiniz Hakkında

source: Location:
fi: Sijainti:
nl: Locatie:
tr: Konum:

source: Specializations:
fi: Erikoisalat:
nl: Specialisaties:
tr: Uzmanlıklar:

source: Hours:
fi: Aukioloajat:
nl: Openingstijden:
tr: Saatler:

source: View Clinic Profile
fi: Näytä klinikan profiili
nl: Kliniekprofiel bekijken

source: Ready to Get Started?
fi: Valmis aloittamaan?
nl: Klaar om te beginnen?
tr: Başlamaya Hazır mısınız?

source: Join thousands of pet owners who trust FAMMO for their pet care needs.
fi: Liity tuhansien lemmikinomistajien joukkoon, jotka luottavat FAMMOon lemmikkiensä hoitotarpeissa.
nl: Sluit je aan bij duizenden huisdiereigenaren die FAMMO vertrouwen voor de zorg van hun huisdieren.

source: Special Referral Bonus
fi: Erityinen suositusbonus
nl: Speciale verwijzingsbonus
tr: Özel Yönlendirme Bonusu

source: Free premium features for the first month!
fi: Premium-ominaisuudet maksutta ensimmäisen kuukauden ajan!
nl: Gratis premiumfuncties gedurende de eerste maand!
tr: İlk ay için ücretsiz premium özellikler!

source: 100%% Secure
fi: 100%% turvallinen
nl: 100%% veilig
tr: 100%% Güvenli

source: Vet Approved
fi: Eläinlääkärien hyväksymä
nl: Goedgekeurd door dierenartsen
tr: Veteriner Onaylı

source: Pet Loved
fi: Lemmikkien suosikki
nl: Geliefd bij huisdieren

source: Copied!
nl: Gekopieerd!
tr: Kopyalandı!

source: to
nl: tot

source: of
nl: van

source: AI
tr: Yapay Zeka

source: OK
tr: Tamam

source: Chat
tr: Sohbet

source: Translations
tr: Çeviriler

source: Manage pending translations for various target languages
tr: Farklı hedef diller için bekleyen çevirileri yönetin

source: complete
tr: tamamlandı

source: Translation Actions
tr: Çeviri İşlemleri

source: Extract New Strings
tr: Yeni Metinleri Çıkar

source: Target Language
tr: Hedef Dil

source: Completion Status
tr: Tamamlanma Durumu

source: Translated
tr: Çevrildi

source: Untranslated
tr: Çevrilmedi

source: All Contexts
tr: Tüm Bağlamlar

source: translated
tr: çevrildi

source: untranslated
tr: çevrilmedi

source: CONTEXT
tr: BAĞLAM

source: ENGLISH (SOURCE)
tr: İNGİLİZCE (KAYNAK)

source: TRANSLATION
tr: ÇEVİRİ

source: Enter translation...
tr: Çeviri girin...

source: No translations found matching the selected filters.
tr: Seçilen filtrelere uygun çeviri bulunamadı.

source: Failed to save translation
tr: Çeviri kaydedilemedi

source: Network error occurred
tr: Ağ hatası oluştu

source: Compile all translations? This will update the .mo files.
tr: Tüm çeviriler derlensin mi? Bu işlem .mo dosyalarını günceller.

source: Translations compiled successfully! Please restart your server for changes to take effect.
tr: Çeviriler başarıyla derlendi! Değişikliklerin etkili olması için lütfen sunucuyu yeniden başlatın.

source: Failed to compile translations
tr: Çeviriler derlenemedi

source: Compile all translations?
tr: Tüm çeviriler derlensin mi?

source: Translations compiled successfully!
tr: Çeviriler başarıyla derlendi!

source: Extract new translatable strings from templates? This may take a minute.
tr: Şablonlardan yeni çevrilebilir metinler çıkarılsın mı? Bu işlem biraz zaman alabilir.

source: Failed to extract translations
tr: Çeviriler çıkarılamadı
