Repository: alimalek80/fammo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, nl, tr

source: No subscription
fi: Ei tilausta
nl: Geen abonnement
tr: Abonelik yok

source: Pets:
fi: Lemmikit:
nl: Huisdieren:
tr: Evcil hayvanlar:

source: No pets
fi: Ei lemmikkejä
nl: Geen huisdieren
tr: Evcil hayvan yok

source: No users found.
fi: Käyttäjiä ei löytynyt.
nl: Geen gebruikers gevonden.
tr: Kullanıcı bulunamadı.

source: Registration successful. Please check your email to activate your account.
fi: Rekisteröinti onnistui. Tarkista sähköpostisi aktivoidaksesi tilisi.
nl: Registratie gelukt. Controleer je e-mail om je account te activeren.
tr: Kayıt başarılı. Hesabınızı etkinleştirmek için lütfen e-postanızı kontrol edin.

source: Please correct the errors below.
fi: Korjaa alla olevat virheet.
nl: Corrigeer de onderstaande fouten.
tr: Lütfen aşağıdaki hataları düzeltin.

source: You are already logged in.
fi: Olet jo kirjautunut sisään.
nl: Je bent al ingelogd.
tr: Zaten giriş yapmışsınız.

source: Login successful.
fi: Kirjautuminen onnistui.
nl: Inloggen geslaagd.
tr: Giriş başarılı.

source: Invalid login credentials.
fi: Virheelliset kirjautumistiedot.
nl: Ongeldige inloggegevens.
tr: Geçersiz giriş bilgileri.

source: You have been logged out.
fi: Sinut on kirjattu ulos.
nl: Je bent uitgelogd.
tr: Oturumunuz kapatıldı.

source: Profile updated successfully.
fi: Profiili päivitetty onnistuneesti.
nl: Profiel succesvol bijgewerkt.
tr: Profil başarıyla güncellendi.

source: Activation link is invalid!
fi: Aktivointilinkki on virheellinen!
tr: Etkinleştirme bağlantısı geçersiz!

source: Invalid access. Please use the activation link from your email.
fi: Virheellinen käyttö. Käytä sähköpostiisi lähetettyä aktivointilinkkiä.
nl: Ongeldige toegang. Gebruik de activatielink uit je e-mail.
tr: Geçersiz erişim. Lütfen e‑postanızdaki aktivasyon bağlantısını kullanın.

source: User not found or not activated.
fi: Käyttäjää ei löytynyt tai tiliä ei ole aktivoitu.
nl: Gebruiker niet gevonden of niet geactiveerd.
tr: Kullanıcı bulunamadı veya aktif değil.

source: 🎉 Welcome to FAMO-PET! Your password has been set successfully!
fi: 🎉 Tervetuloa FAMO-PETiin! Salasanasi on asetettu onnistuneesti!
nl: 🎉 Welkom bij FAMO-PET! Je wachtwoord is succesvol ingesteld!
tr: 🎉 FAMO-PET'e Hoş Geldiniz! Şifreniz başarıyla ayarlandı!

source: Nearby Users Report
fi: Läheisten käyttäjien raportti
nl: Rapport nabije gebruikers
tr: Yakındaki Kullanıcılar Raporu

source: Django site admin
fi: Django-sivuston ylläpito
nl: Django sitebeheer
tr: Django site yöneticisi

source: Clinic
fi: Klinikka
nl: Kliniek
tr: Klinik

source: Coordinates
fi: Koordinaatit
nl: Coördinaten
tr: Koordinatlar

source: This clinic has no coordinates set. Add latitude/longitude to enable proximity reports.
fi: Tälle klinikalle ei ole asetettu koordinaatteja. Lisää leveys- ja pituusaste ottaaksesi käyttöön lähialueraportit.
nl: Voor deze kliniek zijn geen coördinaten ingesteld. Voeg breedte- en lengtegraad toe om nabijheidsrapporten mogelijk te maken.
tr: Bu kliniğin koordinatları ayarlı değil. Yakınlık raporlarını etkinleştirmek için enlem/boylam ekleyin.

source: Radius (km)
fi: Säde (km)
tr: Yarıçap (km)

source: Users within
fi: Käyttäjiä säteellä
nl: Gebruikers binnen
tr: Bu mesafedeki kullanıcılar

source: Distance (km)
fi: Etäisyys (km)
nl: Afstand (km)
tr: Mesafe (km)

source: Updated
fi: Päivitetty
nl: Bijgewerkt

source: No users with stored location within the selected radius.
fi: Valitun säteen sisällä ei ole sijainnin tallentaneita käyttäjiä.
nl: Geen gebruikers met opgeslagen locatie binnen de geselecteerde radius.
tr: Seçilen yarıçap içinde konumu kayıtlı kullanıcı bulunamadı.

source: Veterinary Clinic
fi: Eläinklinikka
nl: Dierenkliniek
tr: Veteriner Kliniği

source: Verified Partner
fi: Vahvistettu kumppani
nl: Geverifieerde partner
tr: Doğrulanmış Partner

source: Hours
fi: Aukioloajat
nl: Openingstijden
tr: Çalışma Saatleri

source: Call Now
fi: Soita nyt
nl: Bel nu
tr: Hemen Ara

source: Send Email
fi: Lähetä sähköposti
nl: E-mail sturen

source: Visit Website
fi: Vieraile verkkosivulla
nl: Bezoek website
tr: Web Sitesini Ziyaret Et

source: Share Referral
fi: Jaa suositus
nl: Verwijslink delen
tr: Yönlendirme Paylaş

source: About
fi: Tietoja
nl: Over

source: Lead Veterinarian
fi: Vastaava eläinlääkäri
nl: Hoofd-dierenarts
tr: Baş Veteriner

source: Qualifications:
fi: Pätevyydet:
nl: Kwalificaties:
tr: Nitelikler:

source: Certifications:
fi: Sertifikaatit:
nl: Certificeringen:
tr: Sertifikalar:

source: Location
fi: Sijainti
nl: Locatie
tr: Konum

source: Specializations
fi: Erikoisalat
nl: Specialisaties
tr: Uzmanlıklar

source: Follow Us
fi: Seuraa meitä
nl: Volg ons

source: Join FAMMO
fi: Liity FAMMOon
nl: Word lid van FAMMO

source: Get personalized pet care recommendations and connect with trusted vets.
fi: Saat yksilöllisiä suosituksia lemmikkisi hoitoon ja yhdistyt luotettaviin eläinlääkäreihin.
nl: Krijg gepersonaliseerde aanbevelingen voor de zorg van je huisdier en kom in contact met vertrouwde dierenartsen.
tr: Kişiselleştirilmiş bakım önerileri alın ve güvenilir veterinerlerle bağlantı kurun.

source: Sign Up with This Clinic
fi: Rekisteröidy tämän klinikan kautta
nl: Aanmelden via deze kliniek
tr: Bu Klinikle Kayıt Ol

source: Sign Up for FAMMO
fi: Rekisteröidy FAMMOon
nl: Aanmelden voor FAMMO
tr: FAMMO’ya Kayıt Ol

source: Could not copy link. Please try again.
fi: Linkin kopiointi epäonnistui. Yritä uudelleen.
nl: Kon link niet kopiëren. Probeer het opnieuw.
tr: Bağlantı kopyalanamadı. Lütfen tekrar deneyin.

source: Find Nearby Clinics
fi: Etsi lähiklinikoita
nl: Zoek klinieken in de buurt
tr: Yakındaki Klinikleri Bul

source: Find Veterinary Clinics Near You
fi: Etsi lähimmät eläinklinikat
nl: Vind dierenklinieken bij jou in de buurt
tr: Yakınınızda Veteriner Klinikleri Bulun

source: Allow location access to find the closest veterinary clinics
fi: Salli sijainnin käyttö löytääksesi lähimmät eläinklinikat
nl: Sta locatie-toegang toe om de dichtstbijzijnde dierenklinieken te vinden
tr: En yakın klinikleri bulmak için konum erişimine izin verin

source: Your Location
fi: Sijaintisi
nl: Jouw locatie
tr: Konumunuz

source: Latitude:
fi: Leveysaste:
nl: Breedtegraad:
tr: Enlem:

source: Longitude:
fi: Pituusaste:
nl: Lengtegraad:
tr: Boylam:

source: Accuracy:
fi: Tarkkuus:
nl: Nauwkeurigheid:
tr: Doğruluk:

source: Or Enter Your Location Manually
fi: Tai syötä sijaintisi manuaalisesti
nl: Of voer je locatie handmatig in
tr: Konumu Manuel Gir

source: Enter your city
fi: Kirjoita kaupunkisi
nl: Vul je stad in

source: Search Radius
fi: Hakusäde
nl: Zoekradius
tr: Arama Yarıçapı

source: Search by City
fi: Hae kaupungin mukaan
nl: Zoek op stad
tr: Şehre Göre Ara

source: Nearby Clinics
fi: Lähiklinikat
nl: Klinieken in de buurt
tr: Yakındaki Klinikler

source: Searching for nearby clinics...
fi: Etsitään lähiklinikoita...
nl: Bezig met zoeken naar klinieken in de buurt...
tr: Klinikler aranıyor...

source: No clinics found in your area
fi: Alueeltasi ei löytynyt klinikoita
nl: Geen klinieken gevonden in jouw omgeving
tr: Bölgede klinik bulunamadı

source: Try increasing the search radius
fi: Kokeile kasvattaa hakusädettä
nl: Probeer de zoekradius te vergroten
tr: Arama yarıçapını artırmayı deneyin

source: Location permission is granted. Click the button below to find nearby clinics.
fi: Sijaintilupa on myönnetty. Napsauta alla olevaa painiketta löytääksesi lähiklinikat.
nl: Locatietoegang is toegestaan. Klik op de knop hieronder om klinieken in de buurt te vinden.
tr: Konum izni verildi. Yakındaki klinikleri bulmak için aşağıdaki butona tıklayın.

source: Use My Current Location
fi: Käytä nykyistä sijaintiani
nl: Gebruik mijn huidige locatie
tr: Mevcut Konumumu Kullan

source: Please enable location access in your browser settings or use the manual search below.
fi: Ota sijainnin käyttö käyttöön selaimesi asetuksissa tai käytä alla olevaa manuaalista hakua.
nl: Schakel locatietoegang in je browserinstellingen in of gebruik de handmatige zoekoptie hieronder.
tr: Lütfen tarayıcı ayarlarından konum erişimini açın veya manuel aramayı kullanın.

source: Please enter a city name
fi: Kirjoita kaupungin nimi
nl: Vul een stadsnaam in
tr: Lütfen bir şehir adı girin

source: Error loading clinics. Please try again.
fi: Klinikoiden lataamisessa tapahtui virhe. Yritä uudelleen.
nl: Fout bij het laden van klinieken. Probeer het opnieuw.
tr: Klinikler yüklenirken hata oluştu. Lütfen tekrar deneyin.

source: View Details
fi: Näytä tiedot
nl: Details bekijken
tr: Detayları Gör

source: Directions
fi: Reittiohjeet
nl: Route
tr: Yol Tarifi

source: Register Your Veterinary Clinic
fi: Rekisteröi eläinklinikkasi
nl: Registreer uw dierenkliniek
tr: Veteriner Kliniğinizi Kaydedin

source: Join FAMMO as a Partner Clinic
fi: Liity FAMMOn yhteistyöklinikaksi
nl: Sluit je aan bij FAMMO als partnerkliniek
tr: FAMMO'ya Partner Klinik olarak katılın

source: Connect with pet owners and grow your practice through our trusted platform
fi: Tutustu lemmikinomistajiin ja kasvata toimintaasi luotettavan alustamme kautta
nl: Kom in contact met huisdiereigenaren en laat uw praktijk groeien via ons vertrouwde platform
tr: Evcil hayvan sahipleriyle bağlantı kurun ve kliniğinizi büyütün

source: Account Information
fi: Tilin tiedot
nl: Accountgegevens
tr: Hesap Bilgileri

source: Clinic Information
fi: Klinikan tiedot
nl: Kliniekinformatie
tr: Klinik Bilgileri

source: Veterinarian Profile
fi: Eläinlääkärin profiili
nl: Dierenartsprofiel

source: Optional
fi: Valinnainen
nl: Optioneel

source: I have read and agree to
fi: Olen lukenut ja hyväksyn
nl: Ik heb gelezen en ga akkoord met
tr: Okudum ve kabul ediyorum

source: FAMMO.ai's Terms and Conditions for Clinics
fi: FAMMO.ai:n klinikoille tarkoitetut käyttöehdot
nl: De algemene voorwaarden voor klinieken van FAMMO.ai
tr: FAMMO.ai Klinik Şartlar ve Koşulları

source: I have read and agree to the
fi: Olen lukenut ja hyväksyn
nl: Ik heb gelezen en ga akkoord met de
tr: Okudum ve kabul ediyorum:

source: FAMMO Clinic Partnership Agreement
fi: FAMMOn klinikkakumppanuussopimuksen
nl: FAMMO-partnerovereenkomst voor klinieken
tr: FAMMO Klinik Ortaklık Sözleşmesi

source: Cancel
fi: Peruuta
nl: Annuleren
tr: İptal

source: Register Clinic
fi: Rekisteröi klinikka
nl: Kliniek registreren

source: Check Your Email!
fi: Tarkista sähköpostisi!
nl: Controleer je e-mail!

source: Registration almost complete
fi: Rekisteröinti melkein valmis
nl: Registratie bijna voltooid
tr: Kayıt neredeyse tamamlandı

source: Thank you for registering!
fi: Kiitos rekisteröitymisestäsi!
nl: Bedankt voor je registratie!
tr: Kayıt olduğunuz için teşekkürler!

source: We've sent a confirmation email to verify your clinic's email address.
fi: Olemme lähettäneet vahvistussähköpostin klinikkasi sähköpostiosoitteen vahvistamiseksi.
nl: We hebben een bevestigingsmail gestuurd om het e-mailadres van je kliniek te verifiëren.
tr: Klinik e‑posta adresinizi doğrulamak için size bir onay e-postası gönderdik.

source: Next Steps
fi: Seuraavat vaiheet
nl: Volgende stappen
tr: Sonraki Adımlar

source: Check your email inbox
fi: Tarkista sähköpostilaatikkosi
nl: Controleer je e-mailinbox
tr: E‑posta kutunuzu kontrol edin

source: Look for an email from FAMMO with the subject 'Confirm Your Clinic Email'
fi: Etsi FAMMOlta saapunut viesti, jonka aiheena on "Confirm Your Clinic Email"
nl: Zoek naar een e-mail van FAMMO met als onderwerp 'Confirm Your Clinic Email'
tr: ‘Klinik E‑postanızı Doğrulayın’ konu başlıklı e-postayı bulun

source: Click the confirmation link
fi: Napsauta vahvistuslinkkiä
nl: Klik op de bevestigingslink
tr: Onay bağlantısına tıklayın

source: This will verify your email address
fi: Tämä vahvistaa sähköpostiosoitteesi
nl: Dit verifieert je e-mailadres
tr: Bu işlem e‑postanızı doğrular

source: Wait for admin approval
fi: Odota ylläpidon hyväksyntää
nl: Wacht op goedkeuring door de beheerder
tr: Yönetici onayını bekleyin

source: Our team will review and approve your clinic
fi: Tiimimme tarkistaa ja hyväksyy klinikkasi
nl: Ons team beoordeelt en keurt je kliniek goed
tr: Ekibimiz kliniğinizi inceleyip onaylayacak

source: Access your dashboard
fi: Pääset hallintapaneeliisi
nl: Ga naar je dashboard

source: Get full access to referral tracking and analytics
fi: Saat täyden pääsyn suositusten seurantaan ja analytiikkaan
nl: Krijg volledige toegang tot verwijzingsbeheer en statistieken
tr: Yönlendirme takibi ve analitiklere tam erişim kazanın

source: Important
fi: Tärkeää
nl: Belangrijk
tr: Önemli

source: The confirmation link expires in 24 hours
fi: Vahvistuslinkki vanhenee 24 tunnin kuluttua
nl: De bevestigingslink verloopt na 24 uur
tr: Onay bağlantısı 24 saat içinde geçersiz olur

source: Check your spam/junk folder if you don't see the email
fi: Tarkista roskapostikansio, jos et näe viestiä
nl: Controleer je spam-/reclamefolder als je de e-mail niet ziet
tr: E‑postayı göremiyorsanız spam/junk klasörünü kontrol edin

source: Your clinic won't be publicly listed until both email confirmation and admin approval are complete
fi: Klinikkaasi ei listata julkisesti ennen kuin sekä sähköpostin vahvistus että ylläpidon hyväksyntä on tehty
nl: Je kliniek wordt pas openbaar weergegeven nadat zowel e-mailbevestiging als goedkeuring door de beheerder zijn voltooid
tr: Klinik, e‑posta doğrulaması ve yönetici onayı tamamlanana kadar herkese açık görünmez

source: What you'll get after approval
fi: Mitä saat hyväksynnän jälkeen
nl: Wat je krijgt na goedkeuring
tr: Onaydan sonra alacaklarınız

source: Public listing in FAMMO's trusted clinic directory
fi: Julkinen näkyvyys FAMMOn luotettujen klinikoiden hakemistossa
nl: Openbare vermelding in FAMMO's overzicht van vertrouwde klinieken
tr: FAMMO'nun güvenilir klinik dizininde listelenme

source: Referral code generation and tracking
fi: Suosituskoodien luonti ja seuranta
nl: Aanmaak en tracking van verwijzingscodes
tr: Yönlendirme kodu oluşturma ve takibi

source: Detailed analytics dashboard
fi: Yksityiskohtainen analytiikkapaneeli
nl: Gedetailleerd analysetableau
tr: Ayrıntılı analitik panel

source: Access to referred customer information
fi: Pääsy suositeltujen asiakkaiden tietoihin
nl: Toegang tot informatie over doorverwezen klanten
tr: Yönlendirilen kullanıcı bilgilerine erişim

source: Return to Home
fi: Palaa etusivulle
nl: Terug naar homepagina
tr: Ana Sayfaya Dön

source: Browse Partner Clinics
fi: Selaa kumppaniklinikoita
nl: Bekijk partnerklinieken
tr: Partner Klinikleri İncele

source: Didn't receive the email?
fi: Et saanut sähköpostia?
nl: Heb je de e-mail niet ontvangen?
tr: E‑posta gelmedi mi?

source: Please
fi: Ole hyvä ja
nl: Neem dan
tr: Lütfen

source: contact our support team
fi: ota yhteyttä tukeemme
nl: contact op met ons ondersteuningsteam
tr: destek ekibimizle iletişime geçin

source: and we'll help you complete the registration.
fi: niin autamme sinua viimeistelemään rekisteröinnin.
nl: en we helpen je de registratie te voltooien.
tr: kayıt işlemini tamamlamanıza yardımcı oluruz.

source: Analytics
fi: Analytiikka
tr: Analitik

source: Back to Dashboard
fi: Takaisin hallintapaneeliin
nl: Terug naar dashboard

source: Overview
fi: Yleiskatsaus
nl: Overzicht
tr: Genel Bakış

source: Referrals
fi: Suositukset
nl: Verwijzingen
tr: Yönlendirmeler

source: Total Referrals
fi: Suosituksia yhteensä
nl: Totaal aantal verwijzingen

source: Conversion Rate
fi: Konversioprosentti
nl: Conversieratio
tr: Dönüşüm Oranı

source: Referral Code Performance
fi: Suosituskoodien toimivuus
nl: Prestaties van verwijzingscodes
tr: Yönlendirme Kod Performansı

source: Active
fi: Aktiivinen
nl: Actief

source: Inactive
fi: Epäaktiivinen
nl: Inactief
tr: Pasif

source: referrals
fi: suositusta
nl: verwijzingen
tr: yönlendirme

source: users
fi: käyttäjää
nl: gebruikers

source: No referral data
fi: Suositustietoja ei ole
nl: Geen verwijzingsgegevens
tr: Yönlendirme verisi yok

source: Start sharing your referral codes to see analytics.
fi: Ala jakaa suosituskoodejasi nähdäksesi analytiikan.
nl: Deel je verwijzingscodes om statistieken te zien.
tr: Yönlendirme kodlarını paylaşarak analizleri görebilirsiniz.

source: Growth Insights
fi: Kasvun tunnusluvut
nl: Groei-inzichten
tr: Büyüme İçgörüleri

source: Percentage of referrals that became active users
fi: Prosenttiosuus suosituksista, jotka muuttuivat aktiivisiksi käyttäjiksi
nl: Percentage verwijzingen dat actieve gebruikers is geworden
tr: Aktif kullanıcıya dönüşen yönlendirme yüzdesi

source: Weekly Activity
fi: Viikoittainen aktiivisuus
nl: Wekelijkse activiteit

source: this week
fi: tällä viikolla
nl: deze week
tr: bu hafta

source: Referrals received in the last 7 days
fi: Viimeisen 7 päivän aikana saadut suositukset
nl: Verwijzingen ontvangen in de afgelopen 7 dagen
tr: Son 7 günde alınan yönlendirmeler

source: Monthly Activity
fi: Kuukausittainen aktiivisuus
nl: Maandelijkse activiteit
tr: Aylık Aktivite

source: this month
fi: tässä kuussa
nl: deze maand

source: Referrals received in the last 30 days
fi: Viimeisen 30 päivän aikana saadut suositukset
nl: Verwijzingen ontvangen in de afgelopen 30 dagen
tr: Son 30 günde alınan yönlendirmeler

source: Tips to Improve
fi: Vinkkejä parantamiseen
nl: Tips ter verbetering
tr: Geliştirme İpuçları

source: Share referral links on social media
fi: Jaa suosituslinkkejä sosiaalisessa mediassa
nl: Deel verwijzingslinks op sociale media
tr: Yönlendirme bağlantılarını sosyal medyada paylaşın

source: Include links in email signatures
fi: Lisää linkit sähköpostisi allekirjoitukseen
nl: Voeg links toe aan je e-mailhandtekening
tr: E‑posta imzasına ekleyin

source: Mention FAMMO to satisfied clients
fi: Kerro FAMMOsta tyytyväisille asiakkaille
nl: Noem FAMMO bij tevreden klanten
tr: Memnun müşterilerinize FAMMO’dan bahsedin

source: Create custom QR codes for easy sharing
fi: Luo omia QR-koodeja helppoa jakamista varten
nl: Maak aangepaste QR-codes voor eenvoudig delen
tr: Kolay paylaşım için özel QR kodları oluşturun

source: Manage Referrals
fi: Hallinnoi suosituksia
nl: Verwijzingen beheren
tr: Yönlendirmeleri Yönet

source: Update Profile
fi: Päivitä profiili
nl: Profiel bijwerken

source: View Public Profile
fi: Näytä julkinen profiili
nl: Openbaar profiel bekijken

source: Clinic Verification Status
fi: Klinikan vahvistustila
nl: Verificatiestatus van de kliniek
tr: Klinik Doğrulama Durumu

source: Email Confirmed
fi: Sähköposti vahvistettu
nl: E-mail bevestigd
tr: E‑posta Doğrulandı

source: Your email is verified
fi: Sähköpostisi on vahvistettu
nl: Je e-mailadres is geverifieerd
tr: E‑postanız doğrulandı

source: Email Pending
fi: Sähköpostin vahvistus kesken
nl: E-mail in afwachting
tr: E‑posta Beklemede

source: Check your email for confirmation link
fi: Tarkista sähköpostisi vahvistuslinkin varalta
nl: Controleer je e-mail voor de bevestigingslink
tr: Onay bağlantısı için e‑postanızı kontrol edin

source: Admin Approved
fi: Ylläpito hyväksynyt
nl: Goedgekeurd door beheerder
tr: Yönetici Onaylandı

source: Your clinic is approved
fi: Klinikkasi on hyväksytty
nl: Je kliniek is goedgekeurd
tr: Klinik onaylandı

source: Admin Review
fi: Ylläpidon tarkistus
nl: Beoordeling door beheerder
tr: Yönetici İncelemesi

source: Waiting for admin approval
fi: Odottaa ylläpidon hyväksyntää
nl: In afwachting van goedkeuring door beheerder
tr: Yönetici onayı bekleniyor

source: Public Listing
fi: Julkinen listaus
nl: Openbare vermelding
tr: Herkese Açık Liste

source: Visible to users
fi: Näkyy käyttäjille
nl: Zichtbaar voor gebruikers
tr: Kullanıcılara görünür

source: Hidden
fi: Piilotettu
nl: Verborgen
tr: Gizli

source: Not publicly visible yet
fi: Ei vielä julkisesti näkyvissä
nl: Nog niet openbaar zichtbaar
tr: Henüz herkese açık değil

source: Next Steps:
fi: Seuraavat vaiheet:
nl: Volgende stappen:
tr: Sonraki Adımlar:

source: Check your email and click the confirmation link
fi: Tarkista sähköpostisi ja napsauta vahvistuslinkkiä
nl: Controleer je e-mail en klik op de bevestigingslink
tr: E‑postadaki onay bağlantısına tıklayın

source: Wait for admin review (typically 1-3 business days)
fi: Odota ylläpidon tarkistusta (yleensä 1–3 arkipäivää)
nl: Wacht op beoordeling door de beheerder (meestal 1–3 werkdagen)
tr: Yönetici incelemesini bekleyin (genelde 1‑3 iş günü)

source: Your clinic should be publicly visible soon!
fi: Klinikkasi pitäisi näkyä julkisesti pian!
nl: Je kliniek zal binnenkort openbaar zichtbaar zijn!
tr: Klinik yakında herkese açık görünecektir!

source: Active Users
fi: Aktiiviset käyttäjät
nl: Actieve gebruikers

source: New Referrals
fi: Uudet suositukset
nl: Nieuwe verwijzingen
tr: Yeni Yönlendirmeler

source: Status
fi: Tila

source: Listed (Pending Verification)
fi: Listattu (vahvistus kesken)
nl: Vermeld (in afwachting van verificatie)
tr: Listelendi (Doğrulama Bekliyor)

source: Email Confirmation Pending
fi: Sähköpostin vahvistus odottaa
nl: E-mailbevestiging in afwachting
tr: E‑posta Doğrulama Bekliyor

source: Recent Referrals
fi: Viimeisimmät suositukset
nl: Recente verwijzingen
tr: Son Yönlendirmeler

source: User
fi: Käyttäjä
nl: Gebruiker

source: Date
fi: Päivämäärä
nl: Datum
tr: Tarih

source: Code
fi: Koodi

source: No referrals yet
fi: Ei vielä suosituksia
nl: Nog geen verwijzingen
tr: Henüz yönlendirme yok

source: Share your referral links to start getting new patients.
fi: Jaa suosituslinkkejä saadaksesi uusia potilaita.
nl: Deel je verwijzingslinks om nieuwe cliënten te krijgen.
tr: Yeni hastalar kazanmak için yönlendirme bağlantılarını paylaşın.

source: Referral Codes
fi: Suosituskoodit
nl: Verwijzingscodes
tr: Yönlendirme Kodları

source: Created
fi: Luotu
nl: Aangemaakt
tr: Oluşturuldu

source: Copy
fi: Kopioi
nl: Kopiëren
tr: Kopyala

source: No referral codes available.
fi: Suosituskoodeja ei ole saatavilla.
nl: Geen verwijzingscodes beschikbaar.
tr: Henüz yönlendirme kodu yok.

source: Update Clinic Profile
fi: Päivitä klinikan profiili
nl: Kliniekprofiel bijwerken

source: Current logo
fi: Nykyinen logo
nl: Huidig logo
tr: Mevcut logo

source: Referrals Management
fi: Suositusten hallinta
nl: Verwijzingen beheren

source: Total
fi: Yhteensä
nl: Totaal

source: New
fi: Uusi
nl: Nieuw
tr: Yeni

source: All Referrals
fi: Kaikki suositukset
nl: Alle verwijzingen
tr: Tüm Yönlendirmeler

source: Referral Code
fi: Suosituskoodi
nl: Verwijzingscode
tr: Yönlendirme Kodu

source: Registered User
fi: Rekisteröity käyttäjä
nl: Geregistreerde gebruiker

source: Visitor
fi: Vierailija
nl: Bezoeker
tr: Ziyaretçi

source: results
fi: tuloksesta
nl: resultaten
tr: sonuç

source: Page
fi: Sivu
nl: Pagina
tr: Sayfa

source: Create New Referral Code
fi: Luo uusi suosituskoodi
nl: Nieuwe verwijzingscode maken
tr: Yeni Yönlendirme Kodu Oluştur

source: Generate Code
fi: Luo koodi
nl: Code genereren
tr: Kod Üret

source: Your Referral Codes
fi: Suosituskoodisi
nl: Je verwijzingscodes
tr: Yönlendirme Kodlarınız

source: Copy Link
fi: Kopioi linkki
nl: Link kopiëren
tr: Bağlantıyı Kopyala

source: No referral codes created yet.
fi: Suosituskoodeja ei ole vielä luotu.
nl: Er zijn nog geen verwijzingscodes aangemaakt.
tr: Henüz yönlendirme kodu oluşturulmadı.

source: How to Use Referral Codes
fi: Näin käytät suosituskoodeja
nl: Hoe gebruik je verwijzingscodes
tr: Yönlendirme Kodları Nasıl Kullanılır

source: Share referral links with your clients
fi: Jaa suosituslinkkejä asiakkaillesi
nl: Deel verwijzingslinks met je cliënten
tr: Bağlantıları müşterilerinizle paylaşın

source: Track new user registrations
fi: Seuraa uusia käyttäjärekisteröintejä
nl: Volg nieuwe gebruikersregistraties
tr: Yeni kullanıcı kayıtlarını takip edin

source: Monitor conversion rates
fi: Seuraa konversioprosentteja
nl: Monitor conversieratio's
tr: Dönüşüm oranlarını izleyin

source: Build your client base through FAMMO
fi: Kasvata asiakaskuntaasi FAMMOn avulla
nl: Bouw je klantenbestand op via FAMMO
tr: FAMMO ile müşteri tabanınızı büyütün
